hiperiondev/esp32idf_APRS/main/aprs_service.c
// @file aprs_service.c
//
// @author Emiliano Augusto Gonzalez ( lu3vea @ gmail . com)
// @date 2026
// @copyright GNU General Public License v3
// @see https://github.com/hiperiondev/esp32idf_APRS
//
// @note
// This is based on other projects:
//     VP-Digi: https://github.com/sq8vps/vp-digi
//     ESP32APRS: https://github.com/nakhonthai/ESP32APRS_Audio
//     LibAPRS: https://github.com/markqvist/LibAPRS
//
//     please contact their authors for more information.
//
// @brief APRS application layer: maps g_config onto the modem configuration,
// installs the modem RX callback that feeds the digipeater, IGate, message,
// lastheard and trafficlog components, provides the TNC2 transmit path and runs
// the periodic service tick.

#include <ctype.h>
#include <stdatomic.h>
#include <stdio.h>
#include <string.h>
#include <strings.h>

#include "esp_log.h"
#include "esp_random.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

#include "afsk.h"
#include "ax25.h"
#include "esp32idf_radioamateur_modem.h"
#include "esp32idf_radioamateur_modem_config.h"
#include "modem.h"

#include "app_config.h"
#include "aprs_bm.h"
#include "aprs_coord.h"
#include "aprs_filter.h"
#include "aprs_path.h"
#include "aprs_service.h"
#include "beacon.h"
#include "beacon_scheduler.h"
#include "bulletins.h"
#include "digirepeater.h"
#include "heap_monitor.h"
#include "igate.h"
#include "lastheard.h"
#include "message.h"
#include "objects_items.h"
#include "query.h"
#include "str_append.h"
#include "telegram_app.h"
#include "telemetry.h"
#include "time_sync.h"
#include "trafficlog.h"
#include "weather.h"
#include "winlink.h" // winlink_init(), winlink_tick_1hz(), winlink_is_service_call()

static const char *TAG = "aprs_service";

// Stack budget for serviceTickTask (the 1 Hz housekeeping tick started by
// aprs_service_start()). Its own per-pass work (heap_monitor_tick_1hz(),
// weather_service_1hz(), telemetry_service_1hz(), time_sync_1hz(),
// telegram_app_tick_1hz(), winlink_tick_1hz()) is shallow bookkeeping, but
// when g_config.msg_enable is set the pass also calls sendAPRSMessageRetry(),
// which walks the same TNC2/AX.25 encode chain
// (aprs_service_send_tnc2 -> modem_send_tnc2 -> modem_build_frame_tnc2 ->
// ax25_encode/hdlcFrame) the beacon scheduler sizes BEACON_SCHED_TASK_STACK_BYTES
// for. That TX path, not the housekeeping calls around it, is what sets this
// budget.
//
// Set with headroom rather than trimmed to a measured minimum, the same way
// BEACON_SCHED_TASK_STACK_BYTES, GPS_TASK_STACK_BYTES and the httpd
// config.stack_size are. Use uxTaskGetStackHighWaterMark() on this task
// (logged every pass in serviceTickTask) before lowering it.
#define APRS_SVC_TICK_TASK_STACK_BYTES 10240

// Destination call this station's own INET->RF third-party frames key up
// under, matching the destination every other own-originated packet type
// (beacon, weather, telemetry, bulletins, objects/items) uses.
#define IGATE_THIRDPARTY_DEST APRS_TOCALL

// How many frames aprs_service_send_tnc2() lets pile up in the RF TX ring
// before it starts discarding new packets instead of queuing them (see the
// comment inside that function).
//
// This is g_config.rf_tx_buffers, web-configurable on the Radiomodem page's
// Audio/AFSK section as "TX buffers", and persisted to /storage/radio.json.
// aprs_service_send_tnc2() reads g_config.rf_tx_buffers directly on every
// call, so a Save on that page takes effect immediately, on the very next
// transmit, without a reboot. RF_TX_BUFFERS_MIN/MAX (aprs_service.h) bound
// both the web form (page_radio.c) and the value loaded from flash
// (app_config.c) - see aprs_service.h for why they're tied to
// AX25_TX_FRAME_RING_MAX rather than an independently-chosen number.

// When the beacon scheduler hands off a frame and the RF TX ring is momentarily
// full with a previous beacon from the SAME synchronous pass (the common case
// with the default TX buffers = 1, when e.g. tracker/WX/telemetry come due
// together), wait up to this long for the ring to drain below the limit rather
// than dropping. A single 1200 Bd frame plus TXDelay/slot time is well under a
// second, so this budget comfortably covers one in-flight frame clearing the
// air; the cap only exists so a wedged modem (ring never draining) can't hang
// the scheduler task indefinitely. Only the beacon scheduler context waits
// (see aprs_service_set_beacon_context()); every other caller drops rather than waits.
#define RF_TX_DRAIN_WAIT_MS 4000
#define RF_TX_DRAIN_POLL_MS 20

// ---------------------------------------------------------------------------
// Long-term TX duty-cycle limiter
//
// The CSMA/p-persistent gear above (tx_timeslot, csma_persist) and the RF TX
// ring backlog cap (rf_tx_buffers) only ever look at the instant a frame is
// offered for transmission: whether the channel is clear right now, and
// whether the ring has room right now. Neither one bounds how much of a
// rolling window this station itself spends transmitting - a scheduler pass
// in which several independently-scheduled periodic reports (beacon,
// objects/items, weather, telemetry, bulletins) fall due together clears
// CSMA individually, one after another, with no ceiling on the cumulative
// airtime that run adds up to.
// This accumulator gives that ceiling, tracked independently of channel
// contention, as standard practice (and in several band plans a hard
// regulatory requirement) for an unattended/automatic station.
//
// The window is a fixed-size ring of DUTY_CYCLE_BUCKET_COUNT buckets, each
// covering DUTY_CYCLE_BUCKET_MS of wall-clock time and holding the
// milliseconds of estimated airtime transmitted during it. Advancing the
// window (duty_cycle_advance_locked()) zeroes every bucket the clock has
// moved past since the last touch, so the sum of all buckets is always the
// airtime transmitted within the last DUTY_CYCLE_WINDOW_MS, no separate
// timer or task required to age entries out.
#define DUTY_CYCLE_WINDOW_MS    (10U * 60U * 1000U)                           // rolling window the ceiling is measured over: 10 minutes
#define DUTY_CYCLE_BUCKET_MS    (15U * 1000U)                                 // width of one accumulator bucket
#define DUTY_CYCLE_BUCKET_COUNT (DUTY_CYCLE_WINDOW_MS / DUTY_CYCLE_BUCKET_MS) // number of buckets the ring holds (40 at the defaults above)

