hiperiondev/esp32idf_APRS/main/aprs_service.c
// Fixed per-frame overhead, in bytes, folded into estimate_tx_airtime_ms()'s
// airtime estimate on top of the TNC2 text length: the opening/closing HDLC
// flag bytes and the 2-byte FCS that the encoded AX.25 frame carries and the
// TNC2 text does not.
#define DUTY_CYCLE_FRAME_OVERHEAD_BYTES 8

// Worst-case HDLC bit-stuffing allowance, percent, added to the raw bit count
// in estimate_tx_airtime_ms(): one stuffed bit is inserted per five
// consecutive 1 bits, so this over-estimates rather than under-estimates the
// airtime a frame actually spends on the air.
#define DUTY_CYCLE_BITSTUFF_PCT 20

// Size of the buffer aprs_msg_callback() renders a received frame into. See
// the derivation of the 365-character worst case there; rounded up to 384 to
// leave the render immune to a future change in how a callsign is printed,
// while staying well inside the modem service task's stack.
#define APRS_RX_TNC2_BUF_SIZE 384

// ---------------------------------------------------------------------------
// Modem configuration
//
// Single mapping point from g_config to the component's modem_config_t, used
// by main.c at boot, by page_radio.c's Save (live re-apply, no reboot) and by
// the LOOP TEST below (which only overrides full_duplex).
//
// What the modem component does NOT take at runtime, and where each setting
// lives instead:
//   audio pins        -> compile-time MODEM_ADC_GPIO / MODEM_DAC_GPIO, set in
//                        the top-level CMakeLists.txt. Changing the audio
//                        front-end pins requires a rebuild.
//   ADC attenuation   -> compile-time MODEM_ADC_ATTEN (ADC_ATTEN_DB_12).
//   hardware squelch  -> none. The component reads no squelch line and has no
//                        RF power-switch output either; its receive gate is
//                        a software level threshold (rx_tuning.gate_mv).
//   RX volume, AGC
//   gain ceiling      -> none. The component's AGC is self-limiting; a fixed
//                        receive gain is part of rx_tuning instead.
//
// PTT's active level (MODEM_PTT_ACTIVE_HIGH) is mapped at runtime (below)
// straight from the compile-time macro, exactly like the PTT GPIO itself
// (MODEM_PTT_GPIO): both are fixed, compile-time-only board wiring choices -
// internal radiomodem features, exactly like MODEM_ADC_GPIO / MODEM_DAC_GPIO
// - and neither is stored in g_config nor exposed on the Radiomodem web
// page. The CMakeLists.txt board definition is the single source of truth
// for the PTT polarity.
// ---------------------------------------------------------------------------
void aprs_service_build_modem_config(modem_config_t *cfg, bool full_duplex) {
    modem_config_t base = MODEM_DEFAULT_CONFIG();
    *cfg = base;

    // afskModem on the Radio page: 0=300 Bd, 1=1200 Bd Bell202, 2=1200 Bd V.23,
    // 3=9600 Bd G3RUH. modem_mode_t uses exactly the same numbering
    // (MODEM_MODEM_AFSK300=0 .. MODEM_MODEM_G3RUH=3), which is why this is a
    // plain cast; page_radio.c already clamps the field to 0-3.
    cfg->modem = (modem_mode_t)g_config.afsk_modem_type;

    // audioLPF on the Radio page is the flat-audio-input flag despite its
    // name: it tells the demodulator that the receiver feeds it discriminator
    // (unfiltered) audio rather than speaker audio, which is exactly what
    // modem_config_t.flat_audio selects. Direct one-to-one mapping.
    cfg->flat_audio = g_config.audio_lpf;

    cfg->preamble_ms = g_config.preamble;
    cfg->slot_time_ms = g_config.tx_timeslot;
    cfg->persist = g_config.csma_persist;
    cfg->fx25_mode = g_config.fx25_mode;
    cfg->allow_non_aprs = false;

    // Extra minimum PTT-off (unkeyed) hold time between transmissions, on
    // top of the fixed one-service-tick release holdoff the modem component
    // always applies (see Ax25TransmitCheck()'s txReleaseHoldoff in ax25.c).
    // Web-configurable (Radiomodem page, Audio/AFSK section), 0 = disabled
    // (only the fixed one-tick floor applies).
    cfg->min_unkey_ms = g_config.ptt_min_unkey_ms;

    // PTT pin and PTT active level are both fixed at compile time
    // (MODEM_PTT_GPIO / MODEM_PTT_ACTIVE_HIGH, set from the top-level
    // CMakeLists.txt); neither is part of modem_config_t as a user-facing
    // setting, and neither is configurable from the Radiomodem web page.
    cfg->ptt_active_high = (MODEM_PTT_ACTIVE_HIGH != 0);

    // Half duplex for real on-air use: MODEM_DEFAULT_CONFIG() ships full
    // duplex (it targets the wire-loopback demo), which would key up over
    // anyone already transmitting. CSMA/quiet time comes from txTimeSlot,
    // and the p-persistent transmit probability comes from csma_persist.
    // The LOOP TEST passes true here because a DAC->ADC wire means the node
    // always hears its own carrier and would never see a clear channel.
    cfg->full_duplex = full_duplex;

    // Audio interface. Everything here describes what sits between the ADC/DAC
    // pins and the transceiver, so the defaults suit an interface board that
    // brings its own bias network, attenuators and reconstruction filter: the
    // input is left unbiased, over-range blocks are not reported, the output
    // swing and sample rate are the compiled-in ones and the transmitter
    // time-out is off. An interface reduced to a coupling capacitor and a
    // level trimmer per direction is what the other settings are for.
    cfg->adc_self_bias = g_config.adc_self_bias;
    cfg->rx_clip_warn = g_config.rx_clip_warn;
    cfg->dac_amplitude_pct = g_config.dac_amplitude_pct;
    cfg->dac_samplerate = g_config.dac_samplerate;
    cfg->tx_max_keyed_ms = g_config.tx_max_keyed_ms;

    // Receive chain: demodulator set, prefilter band, receive gate,
    // high-pass, gain control and bit repair, taken as stored (already
    // sanitized on load and on Save; modem_set_modem() sanitizes again).
    cfg->rx = g_config.rx_tuning;
}

// ---------------------------------------------------------------------------
// Dashboard statistics.
//
// These are the counters the web dashboard's STATISTICS panel actually wants
// (page_common.c's page_sidebar_info()): total RF frames decoded, total RF
// frames transmitted, frames relayed RF->INET and INET->RF, digipeated
// frames, and drop/error counts - all independent of whether the digipeater
// or IGate features are even enabled.
//
// These are tracked directly at the points where frames actually flow
// (on_rx_frame(), aprs_service_send_tnc2(), inet2rfHandler(), and inside
// aprs_msg_callback() for the digi/igate/error cases), rather than derived
// from igate_get_stats() - whose counters only increment from inside
// igateProcess(), and only when g_config.igate_en is true (see
// aprs_msg_callback() below). With the feature off (a very common RX-only/
// monitor setup), feature-derived counters would stay at 0 regardless of how
// much real RF traffic the modem decodes; tracking at the flow points makes
// the dashboard reflect reality whether or not either feature is turned on.
static atomic_uint_fast32_t s_statRadioRx = 0; // frames decoded off RF (every on_rx_frame() call)
static atomic_uint_fast32_t s_statRadioTx = 0; // frames transmitted on RF (every successful aprs_service_send_tnc2())
static atomic_uint_fast32_t s_statRf2Inet = 0; // frames relayed from RF to APRS-IS (igateProcess() actually uplinked one)
static atomic_uint_fast32_t s_statInet2Rf = 0; // lines relayed from APRS-IS to RF (inet2rfHandler() actually transmitted one)
static atomic_uint_fast32_t s_statDigi = 0;    // frames digipeated (path rewritten and re-transmitted)
// The two below track drops/errors independently of the feature-specific
// accounting in igate_get_stats() (see page_common.c's page_sidebar_info()),
// whose counters only move while igate_en is on. For a monitor/RX-only setup
// (both features off - very common while
// characterizing modem decode performance), feature-derived DROP/ERR would
// stay pinned at 0 even with plenty of real RF activity. These two are
// tracked at
// every point a frame is actually discarded - on the RX side in
// on_rx_frame()/aprs_msg_callback(), and on the TX side in
// aprs_service_send_tnc2() (RF TX queue full, oversized packet, modem not
// ready yet, or modem_send_tnc2() itself failing) - so they move regardless
// of which higher-level features are enabled and regardless of which
// direction the discard happens in.
static atomic_uint_fast32_t s_statDrop =
    0; // frames discarded before dispatch or on the way out to RF (placeholder/invalid source callsign, modem-not-ready, TX queue full, oversized packet, etc.)
static atomic_uint_fast32_t s_statErr =
    0; // frames that failed to decode as valid APRS (UI, no-layer-3) AX.25, or that the modem itself failed to transmit (modem_send_tnc2() error)

// Task permitted to briefly block on a full RF TX ring (see the drain-wait in
// aprs_service_send_tnc2()). Set to the beacon scheduler task via
// aprs_service_set_beacon_context(); NULL for everyone else, so the RX/digipeat,
// INET2RF and message paths keep their non-blocking drop-if-full behavior and a
// busy RF leg never stalls RX decode or the APRS-IS socket task.
static volatile TaskHandle_t s_beaconCtxTask = NULL;

