hiperiondev/esp32idf_APRS/main/aprs_service.c
// Forward declaration: the duty-cycle accumulator (state and the rest of its
// helpers) is defined further down, right before the TX helper that feeds it,
// but aprs_service_get_stats() below needs the live percentage too.
static uint8_t duty_cycle_pct(void);

void aprs_service_set_beacon_context(void) {
    s_beaconCtxTask = xTaskGetCurrentTaskHandle();
}

aprs_service_stats_t aprs_service_get_stats(void) {
    aprs_service_stats_t s;
    s.radio_rx = (uint32_t)atomic_load_explicit(&s_statRadioRx, memory_order_relaxed);
    s.radio_tx = (uint32_t)atomic_load_explicit(&s_statRadioTx, memory_order_relaxed);
    s.rf2inet = (uint32_t)atomic_load_explicit(&s_statRf2Inet, memory_order_relaxed);
    s.inet2rf = (uint32_t)atomic_load_explicit(&s_statInet2Rf, memory_order_relaxed);
    s.digi = (uint32_t)atomic_load_explicit(&s_statDigi, memory_order_relaxed);
    s.drop = (uint32_t)atomic_load_explicit(&s_statDrop, memory_order_relaxed);
    s.err = (uint32_t)atomic_load_explicit(&s_statErr, memory_order_relaxed);

    // Current RF TX ring backlog and the effective cap it is measured against,
    // surfaced so the dashboard can show beacons queueing up (and, with the
    // drop counter above, being lost) without a serial cable. Reported straight
    // from the modem ring and the same clamped g_config.rf_tx_buffers value
    // aprs_service_send_tnc2() enforces, so the two always agree.
    s.tx_queue_depth = (uint32_t)modem_tx_queue_depth();

    // CSMA anti-starvation events, read live from the modem rather than
    // mirrored into a local counter: both are free-running totals since boot,
    // so the snapshot is always current and there is no forwarding pass to
    // fall behind or double-count. Neither is a drop - the frame goes out in
    // both cases - which is why they are reported here and not through
    // igate_note_drop().
    s.csma_busy_forced = modem_channel_busy_count();
    s.csma_persist_forced = modem_persistence_missed_count();

    // Duty-cycle figures: the live measured percentage is always populated
    // (see duty_cycle_pct()'s forward declaration below), independent of
    // whether the limiter is enabled, so the dashboard can show what an
    // operator would be capping before they turn it on. duty_cycle_limit_pct
    // reads 0 - "no ceiling enforced" - whenever g_config.duty_cycle_en is off.
    s.tx_duty_cycle_pct = duty_cycle_pct();
    s.duty_cycle_limit_pct = 0;
    if (g_config.duty_cycle_en) {
        uint8_t ceiling = g_config.duty_cycle_pct;
        if (ceiling < DUTY_CYCLE_PCT_MIN)
            ceiling = DUTY_CYCLE_PCT_MIN;
        else if (ceiling > DUTY_CYCLE_PCT_MAX)
            ceiling = DUTY_CYCLE_PCT_MAX;
        s.duty_cycle_limit_pct = ceiling;
    }

    uint8_t lim = g_config.rf_tx_buffers;
    if (lim < RF_TX_BUFFERS_MIN)
        lim = RF_TX_BUFFERS_MIN;
    else if (lim > RF_TX_BUFFERS_MAX)
        lim = RF_TX_BUFFERS_MAX;
    s.tx_queue_limit = lim;
    return s;
}

// Receive configuration the statistics were collected under. The counters
// describe a particular demodulator set, so they restart whenever the modem
// profile, the input type or the receive tuning changes - and only then, so
// the RX LEVEL and LOOP TEST buttons, which save the form before measuring,
// leave them running.
static bool s_rxStatsCfgValid = false;
static modem_mode_t s_rxStatsModem;
static bool s_rxStatsFlat;
static modem_rx_tuning_t s_rxStatsTuning;

static bool rx_tuning_equal(const modem_rx_tuning_t *a, const modem_rx_tuning_t *b) {
    for (int i = 0; i < MODEM_RX_MAX_DEMODULATORS; i++) {
        if (a->custom_tilt_db[i] != b->custom_tilt_db[i])
            return false;
    }
    return (a->eq_preset == b->eq_preset) && (a->custom_count == b->custom_count) && (a->bpf_lo_hz == b->bpf_lo_hz) && (a->bpf_hi_hz == b->bpf_hi_hz) &&
           (a->bpf_taps == b->bpf_taps) && (a->gate_mv == b->gate_mv) && (a->hpf_hz == b->hpf_hz) && (a->agc_mode == b->agc_mode) &&
           (a->agc_fixed_gain_db == b->agc_fixed_gain_db) && (a->fix_bits == b->fix_bits);
}

void aprs_service_apply_modem_config(void) {
    if (!aprs_service_modem_ready())
        return;
    modem_config_t cfg;
    aprs_service_build_modem_config(&cfg, false);
    modem_set_modem(&cfg);

    if (!s_rxStatsCfgValid || (s_rxStatsModem != cfg.modem) || (s_rxStatsFlat != cfg.flat_audio) || !rx_tuning_equal(&s_rxStatsTuning, &cfg.rx)) {
        modem_reset_rx_stats();
        s_rxStatsCfgValid = true;
        s_rxStatsModem = cfg.modem;
        s_rxStatsFlat = cfg.flat_audio;
        s_rxStatsTuning = cfg.rx;
    }
    ESP_LOGI(TAG, "modem re-applied: modem=%u flatAudio=%d preamble=%ums slot=%ums persist=%u fx25=%u minUnkey=%ums", (unsigned)cfg.modem, (int)cfg.flat_audio,
             (unsigned)cfg.preamble_ms, (unsigned)cfg.slot_time_ms, (unsigned)cfg.persist, (unsigned)cfg.fx25_mode, (unsigned)cfg.min_unkey_ms);
}

// Set true once main.c has actually called modem_init() successfully (i.e.
// the audio modem is enabled in config *and* the hardware came up since boot -
// toggling the checkbox without rebooting does not re-run modem_init).
static volatile bool s_modemReady = false;

// ---------------------------------------------------------------------------
// Duty-cycle accumulator state (see the block comment above DUTY_CYCLE_WINDOW_MS).
//
// s_dutyBucketMs[] is a ring of DUTY_CYCLE_BUCKET_COUNT buckets; s_dutyBucketIndex
// names the bucket currently being written. s_dutyBucketBaseUs is the esp_timer
// time that bucket started at, 0 meaning "never transmitted yet" (nothing to
// slide forward). Touched from whichever task happens to be transmitting -
// RX/digipeat, INET2RF, message TX and every own-station beacon task alike -
// so access is protected by a short spinlock rather than assumed
// single-threaded.
static uint32_t s_dutyBucketMs[DUTY_CYCLE_BUCKET_COUNT];
static uint32_t s_dutyBucketIndex = 0;
static int64_t s_dutyBucketBaseUs = 0;
static portMUX_TYPE s_dutyLock = portMUX_INITIALIZER_UNLOCKED;

// Slides the accumulator ring forward to `now_us`, zeroing every bucket the
// clock has moved past since the last call. Must be called with s_dutyLock held.
static void duty_cycle_advance_locked(int64_t now_us) {
    if (s_dutyBucketBaseUs == 0) {
        // First transmission this boot: open the window here rather than
        // treating the whole idle time since startup as part of it.
        s_dutyBucketBaseUs = now_us;
        return;
    }
    int64_t elapsed_ms = (now_us - s_dutyBucketBaseUs) / 1000;
    if (elapsed_ms < (int64_t)DUTY_CYCLE_BUCKET_MS)
        return; // still inside the current bucket, nothing to slide
    uint32_t buckets_elapsed = (uint32_t)(elapsed_ms / DUTY_CYCLE_BUCKET_MS);
    if (buckets_elapsed >= DUTY_CYCLE_BUCKET_COUNT) {
        // The whole window is stale (nothing transmitted for a full
        // DUTY_CYCLE_WINDOW_MS): clear it all in one pass instead of
        // stepping through DUTY_CYCLE_BUCKET_COUNT no-op writes.
        memset(s_dutyBucketMs, 0, sizeof(s_dutyBucketMs));
    } else {
        for (uint32_t i = 0; i < buckets_elapsed; i++) {
            s_dutyBucketIndex = (s_dutyBucketIndex + 1) % DUTY_CYCLE_BUCKET_COUNT;
            s_dutyBucketMs[s_dutyBucketIndex] = 0;
        }
    }
    s_dutyBucketBaseUs += (int64_t)buckets_elapsed * DUTY_CYCLE_BUCKET_MS * 1000;
}

// Sum of every bucket in the ring: the airtime transmitted within the last
// DUTY_CYCLE_WINDOW_MS as of the last duty_cycle_advance_locked() call. Must
// be called with s_dutyLock held.
static uint32_t duty_cycle_used_ms_locked(void) {
    uint32_t total = 0;
    for (uint32_t i = 0; i < DUTY_CYCLE_BUCKET_COUNT; i++)
        total += s_dutyBucketMs[i];
    return total;
}

// Current measured duty cycle, as a percentage of DUTY_CYCLE_WINDOW_MS,
// capped at 100. Safe to call from any task; used both by the TX gate below
// and by aprs_service_get_stats() for the dashboard.
static uint8_t duty_cycle_pct(void) {
    int64_t now = esp_timer_get_time();
    uint32_t used;
    portENTER_CRITICAL(&s_dutyLock);
    duty_cycle_advance_locked(now);
    used = duty_cycle_used_ms_locked();
    portEXIT_CRITICAL(&s_dutyLock);
    uint32_t pct = (used * 100u) / DUTY_CYCLE_WINDOW_MS;
    return (pct > 100u) ? 100 : (uint8_t)pct;
}

// Adds `ms` of estimated airtime to the bucket the current moment falls into.
// Called once per successful RF transmit, critical or not: the ceiling only
// gates non-critical traffic, but message and digipeat traffic still counts
// against the window, since it is real airtime either way.
static void duty_cycle_add_ms(uint32_t ms) {
    int64_t now = esp_timer_get_time();
    portENTER_CRITICAL(&s_dutyLock);
    duty_cycle_advance_locked(now);
    s_dutyBucketMs[s_dutyBucketIndex] += ms;
    portEXIT_CRITICAL(&s_dutyLock);
}

// Baud rate, in bits/second, of the currently configured audio AFSK
// modulation (see g_config.afsk_modem_type / aprs_service_build_modem_config()),
// used only to turn a frame's byte count into an estimated on-air duration
// for the duty-cycle accumulator below.
static uint32_t duty_cycle_baud_rate(void) {
    switch (g_config.afsk_modem_type) { // single-word read, benign if stale
        case 0:
            return 300; // AFSK300
        case 3:
            return 9600; // G3RUH/FSK
        default:
            return 1200; // Bell202 or V.23 (both 1200 Bd)
    }
}

