hiperiondev/esp32idf_APRS/main/aprs_service.c
    // handleIncomingAPRS() is the single ":ADDRESSEE:" parser for three
    // consumers - APRS messaging, directed queries ("CALL:?query?") and the
    // Telegram routing of messages and bulletins - so it must run whenever any
    // one of them is enabled, not just msg_enable, or a directed query would
    // never reach query_process_directed() and no message or bulletin would
    // reach Telegram while messaging is turned off. Both this and
    // query_process() below operate on the frame as received, rendered once at
    // the top of this function, since digiProcess() (if it ran) rewrote the
    // path for retransmission only, not for these consumers.
    if (g_config.msg_enable || (g_config.query_en && g_config.query_directed_en) || telegram_app_routing_active()) {
        handleIncomingAPRS(tnc2, QUERY_SRC_RF);
    }

    if (g_config.query_en) {
        query_process(tnc2, QUERY_SRC_RF);
    }
}

// ---------------------------------------------------------------------------
// Component RX callback.
//
// The modem component hands back the raw AX.25 bytes and leaves the decode to
// us, so this does the ax25_decode() itself, then dispatches to the handlers.
//
// Runs on the component's "modem_svc" task, whose stack the component sizes at
// 6144 bytes - enough for the ax25_msg_t below (~700 B) plus the rest of the
// dispatch chain, but worth remembering before adding anything large here.
//
// s_rxHook is the indirection the LOOP TEST uses to divert received frames to
// itself. It is owned here, not in the modem: the component's callback stays
// installed for the life of the process and only this pointer moves, so the
// diversion cannot disturb the component's own state.
// ---------------------------------------------------------------------------
typedef void (*aprs_rx_hook_t)(ax25_msg_t *msg);
static volatile aprs_rx_hook_t s_rxHook = aprs_msg_callback;

static void on_rx_frame(const modem_rx_frame_t *f, void *ctx) {
    (void)ctx;
    ax25_msg_t msg;

    atomic_fetch_add_explicit(&s_statRadioRx, 1, memory_order_relaxed);

    memset(&msg, 0, sizeof(msg));
    enum Ax25DecodeReason reason;
    if (!ax25_decode((uint8_t *)f->frame, f->len, f->mVrms, &msg, &reason)) {
        // Not a decodable APRS (UI, no-layer-3) frame: msg.info/len were
        // never populated, so there is nothing safe to dispatch; just count
        // it and stop here. This is tracked here unconditionally, regardless
        // of digi_en/igate_en, unlike the digi/igate-only drop/error
        // counters below it in the dashboard.
        //
        // ax25_decode()'s reason splits this into a malformed/corrupted
        // reception (ERR_AX25_DECODE) versus a well-formed frame that is
        // simply not APRS (ERR_AX25_NOT_APRS) - legacy connected-mode AX.25
        // traffic or a non-APRS PID sharing the channel, both expected and
        // benign on a shared frequency. Keeping the two counters and log
        // lines separate lets an operator tell "channel has non-APRS
        // traffic on it" apart from "my decoder is broken" from the
        // dashboard alone.
        atomic_fetch_add_explicit(&s_statErr, 1, memory_order_relaxed);
        if (reason == AX25_DECODE_NOT_UI || reason == AX25_DECODE_NOT_NOLAYER3) {
            igate_note_drop(ERR_AX25_NOT_APRS);
            ESP_LOGD(TAG, "RX non-APRS AX.25 frame (%s), %u bytes, %u mVrms", reason == AX25_DECODE_NOT_UI ? "not UI" : "not no-layer-3 PID", (unsigned)f->len,
                     (unsigned)f->mVrms);
        } else {
            igate_note_drop(ERR_AX25_DECODE);
            ESP_LOGD(TAG, "RX decode error (malformed frame), %u bytes, %u mVrms", (unsigned)f->len, (unsigned)f->mVrms);
        }
        return;
    }

    // Which demodulator produced the frame and what it measured, for tuning
    // the receive chain against real traffic.
    ESP_LOGD(TAG, "RX frame from demod %u: twist %+d dB, %u mVrms, %u bit(s) repaired", (unsigned)f->demod, (int)f->twist_db, (unsigned)f->mVrms,
             (unsigned)f->repaired);

    aprs_rx_hook_t hook = s_rxHook;
    if (hook)
        hook(&msg);
}

// Case-insensitive compare of a TNC2 source base callsign (SSID already
// stripped, given as ptr+len) against one configured own-station call. An
// empty configured call never matches, so report callsigns the operator left
// blank can't accidentally swallow foreign traffic.
static bool base_call_equals(const char *src, size_t srcLen, const char *cfg) {
    if (!cfg || cfg[0] == 0)
        return false;
    if (strlen(cfg) != srcLen)
        return false;
    for (size_t i = 0; i < srcLen; i++) {
        char a = src[i], b = cfg[i];
        if (a >= 'a' && a <= 'z')
            a -= 32;
        if (b >= 'a' && b <= 'z')
            b -= 32;
        if (a != b)
            return false;
    }
    return true;
}

// Number of distinct report sources this station can upload to APRS-IS under
// their own callsign: the IGate beacon/status, the shared "My Station"
// identity, the tracker, the digipeater, the weather station, telemetry and
// APRS messages. OWN_REPORT_CALL_COUNT is the single source of truth for how
// many entries inet_line_is_own_report()'s calls[] array must hold; the
// _Static_assert next to that array fails the build the moment the two drift
// apart, so a report source added to calls[] without updating this constant
// (or vice versa) is caught at compile time rather than surfacing later as a
// silent RF feedback loop.
#define OWN_REPORT_CALL_COUNT 7

// True if this APRS-IS line's SOURCE callsign (base call, SSID ignored) is one
// of THIS station's own report callsigns. Every report this station uploads
// to APRS-IS is echoed straight back by the server; recognising that echo
// here lets inet2rfHandler() skip it instead of re-gating it back to RF, which
// would otherwise cause a feedback loop / double transmission. This station's
// own reports reach RF exclusively through their own "Send via RF" flags in
// weather.c / beacon.c - the IGATE INET->RF filter below is for foreign
// internet traffic only, never our own.
static bool inet_line_is_own_report(const char *line) {
    // Source call is everything up to the first '-' (SSID) or '>' (path).
    size_t srcLen = 0;
    while (line[srcLen] && line[srcLen] != '-' && line[srcLen] != '>')
        srcLen++;
    if (srcLen == 0)
        return false;

    // Every callsign any local report can transmit under. Blank entries are
    // skipped inside base_call_equals(), and reports that fall back to
    // aprs_mycall are covered by that entry.
    //
    // Telemetry's callsign persists to its own /storage/telemetry.json (see
    // telemetry.h), so it is fetched through telemetry_get_mycall() rather
    // than a direct g_config field.
    char tlm_mycall[10];
    telemetry_get_mycall(tlm_mycall, sizeof(tlm_mycall));

    const char *calls[] = {
        g_config.aprs_mycall, g_config.my_callsign, g_config.trk_mycall, g_config.digi_mycall, g_config.wx_mycall, tlm_mycall, g_config.msg_mycall,
    };
    _Static_assert(sizeof(calls) / sizeof(calls[0]) == OWN_REPORT_CALL_COUNT,
                   "calls[] in inet_line_is_own_report() must list exactly OWN_REPORT_CALL_COUNT callsigns; "
                   "update OWN_REPORT_CALL_COUNT alongside any report source added to or removed from this array");
    for (size_t i = 0; i < sizeof(calls) / sizeof(calls[0]); i++) {
        if (base_call_equals(line, srcLen, calls[i]))
            return true;
    }
    return false;
}

// ---------------------------------------------------------------------------
// INET -> RF message gating.
//
// An IGate sits on a very large data stream and must not put messages on the
// air indiscriminately. A message read from APRS-IS is transmitted only when
// all three of the message-specific conditions the APRS-IS IGate design notes
// lay down hold at once: the addressee was heard on the local RF channel
// inside the configured window, the sender was NOT heard on RF inside that
// window, and the addressee is not itself Internet-connected. Each failure
// has its own drop reason so the dashboard's Drop Breakdown says which
// condition stopped a message, which is the question an operator actually
// asks. The header-token/q-construct check (TCPXX / NOGATE / RFONLY / qAX /
// qAZ) applies to every line considered for INET->RF, message or not, so it
// runs once in inet2rfHandler() ahead of this message-specific gating rather
// than being repeated here.
//
// Alongside that runs the associated-position rule: rather than replaying a
// station's historical position reports, the gateway notes the stations it has
// gated a message TO and forwards the next position report it sees for each of
// them, so the local operator has something to plot for the far end of the
// conversation.
//
// The ring below is modified only from inet2rfHandler() and read, without
// being modified, by the msgAssocPending() query the traffic log uses. Both
// run on the single igate task - the log verdict and the gating decision are
// made one after the other for the same line - so the ring needs no lock of
// its own.
// ---------------------------------------------------------------------------

