hiperiondev/esp32idf_APRS/main/aprs_service.c
static char s_msgAssoc[IGATE_MSG_ASSOC_MAX][12];

// Note one addressee as awaiting its position follow-up. A callsign already
// waiting keeps its slot instead of taking a second one; otherwise the oldest
// entry is overwritten, which at this ring size means the follow-up is offered
// for the most recent conversations and quietly forgotten for older ones.
static void msgAssocRemember(const char *call) {
    if (call == NULL || call[0] == 0)
        return;

    for (int i = 0; i < IGATE_MSG_ASSOC_MAX; i++) {
        if (strcasecmp(s_msgAssoc[i], call) == 0)
            return;
    }
    for (int i = 0; i < IGATE_MSG_ASSOC_MAX; i++) {
        if (s_msgAssoc[i][0] == 0) {
            strncpy(s_msgAssoc[i], call, sizeof(s_msgAssoc[i]) - 1);
            s_msgAssoc[i][sizeof(s_msgAssoc[i]) - 1] = 0;
            return;
        }
    }

    memmove(&s_msgAssoc[0], &s_msgAssoc[1], (IGATE_MSG_ASSOC_MAX - 1) * sizeof(s_msgAssoc[0]));
    strncpy(s_msgAssoc[IGATE_MSG_ASSOC_MAX - 1], call, sizeof(s_msgAssoc[0]) - 1);
    s_msgAssoc[IGATE_MSG_ASSOC_MAX - 1][sizeof(s_msgAssoc[0]) - 1] = 0;
}

// Index of the slot one station holds in the ring, or -1 when it holds none.
static int msgAssocFind(const char *call) {
    if (call == NULL || call[0] == 0)
        return -1;

    for (int i = 0; i < IGATE_MSG_ASSOC_MAX; i++) {
        if (strcasecmp(s_msgAssoc[i], call) == 0)
            return i;
    }
    return -1;
}

// Claim the position follow-up owed to one station, if any. The slot is
// released by the claim, so exactly one position report is ever gated per
// message sent - what makes this a follow-up rather than a subscription.
static bool msgAssocTake(const char *call) {
    int i = msgAssocFind(call);
    if (i < 0)
        return false;

    memmove(&s_msgAssoc[i], &s_msgAssoc[i + 1], (size_t)(IGATE_MSG_ASSOC_MAX - 1 - i) * sizeof(s_msgAssoc[0]));
    s_msgAssoc[IGATE_MSG_ASSOC_MAX - 1][0] = 0;
    return true;
}

// Report whether a station is owed a follow-up without spending it. Registered
// with igate_set_inet2rf_assoc_query() so the traffic-log filter mirror in
// igate.c applies the same exception inet2rfHandler() below does: that mirror
// forms its verdict before this handler runs, so it has to look rather than
// claim, and the claim is left for the transmit decision it was recorded for.
static bool msgAssocPending(const char *call) {
    return msgAssocFind(call) >= 0;
}

// ---------------------------------------------------------------------------
// INET->RF per-source spacing
//
// One slot per source callsign gated to RF, holding the tick at which it last
// took the transmitter. A source asking for the channel again inside
// g_config.inet2rf_min_interval_sec is refused; one asking after the interval
// has passed takes its slot over with the new stamp.
//
// Like the ring above, this one is touched only from inet2rfHandler() on the
// single igate task and needs no lock of its own. Ticks are compared as signed
// differences so the comparison stays correct across the tick counter's
// wrap-around.
// ---------------------------------------------------------------------------

typedef struct {
    char call[12];    // source callsign, SSID included; empty marks a free slot
    TickType_t stamp; // tick at which this source was last gated to RF
} inet2rf_rate_slot_t;

static inet2rf_rate_slot_t s_inet2rfRate[INET2RF_RATE_RING_SIZE];

// Ask the limiter for the channel on behalf of one source, and claim it when
// the answer is yes. Answers yes unconditionally while the limiter is off
// (interval 0) or the callsign is unusable, leaving the ring untouched in both
// cases so nothing is recorded that could refuse a later line.
static bool inet2rfRateAllow(const char *call) {
    uint16_t interval;
    app_config_lock();
    interval = g_config.inet2rf_min_interval_sec;
    app_config_unlock();

    if (interval == 0 || call == NULL || call[0] == 0)
        return true;

    const TickType_t now = xTaskGetTickCount();
    const TickType_t span = pdMS_TO_TICKS((uint32_t)interval * 1000U);

    int oldest = 0;
    for (int i = 0; i < INET2RF_RATE_RING_SIZE; i++) {
        if (s_inet2rfRate[i].call[0] == 0) {
            oldest = i;
            break;
        }
        if (strcasecmp(s_inet2rfRate[i].call, call) == 0) {
            if ((int32_t)(now - s_inet2rfRate[i].stamp) < (int32_t)span)
                return false;
            s_inet2rfRate[i].stamp = now;
            return true;
        }
        if ((int32_t)(s_inet2rfRate[i].stamp - s_inet2rfRate[oldest].stamp) < 0)
            oldest = i;
    }

    strncpy(s_inet2rfRate[oldest].call, call, sizeof(s_inet2rfRate[oldest].call) - 1);
    s_inet2rfRate[oldest].call[sizeof(s_inet2rfRate[oldest].call) - 1] = 0;
    s_inet2rfRate[oldest].stamp = now;
    return true;
}

// Copy the addressee out of an APRS message payload. The information field is
// ":ADDRESSEE:text" with the addressee fixed at nine characters, space-padded
// on the right, so the second ':' always sits at info[10]; the padding is
// stripped here so the callsign matches the last-heard table's own key.
// Returns false for anything that is not shaped like a message.
static bool messageAddressee(const char *info, char *out, size_t outMax) {
    if (info == NULL || out == NULL || outMax < 10)
        return false;
    if (info[0] != ':' || strlen(info) < 11 || info[10] != ':')
        return false;

    size_t n = 9;
    while (n > 0 && info[n] == ' ')
        n--;
    memcpy(out, info + 1, n);
    out[n] = 0;
    return n > 0;
}

// True if a message addressee names a broadcast rather than an individual
// station: the bulletin and announcement addressees of APRS101 chapter 14 and
// the addressees the weather service feed uses for its own notices.
//
// A general bulletin is "BLN" followed by a single digit, an announcement is
// "BLN" followed by a single upper-case letter, and a group bulletin appends a
// group name of up to five characters to either - all three share the same
// first four bytes, which is what this tests. The weather service families
// ("NWS-xxxxx" in the specification, plus the "SKY" and "CWA" addressees the
// same feed uses) are matched on their three-letter prefix; none of the three
// can begin an amateur callsign, so no station is caught by them.
static bool addresseeIsBroadcast(const char *addressee) {
    if (addressee == NULL)
        return false;

