hiperiondev/esp32idf_APRS/main/aprs_service.c
    if (!strncmp(addressee, "BLN", 3) && (isdigit((unsigned char)addressee[3]) || isupper((unsigned char)addressee[3])))
        return true;

    static const char *const broadcastPrefixes[] = { "NWS", "SKY", "CWA" };
    for (size_t i = 0; i < sizeof(broadcastPrefixes) / sizeof(broadcastPrefixes[0]); i++) {
        if (!strncmp(addressee, broadcastPrefixes[i], 3))
            return true;
    }

    return false;
}

// True if a TNC2 line carries a message payload whose addressee is one of the
// broadcast addressees above. Anything that is not shaped like a message -
// messageAddressee() enforces the ':' data type identifier and the fixed
// 9-character addressee field followed by its ':' - is not one, so a position
// or object report never reaches the addressee test.
static bool lineIsBroadcastMessage(const char *line) {
    const char *colon = strchr(line, ':');
    char addressee[12];

    if (colon == NULL || !messageAddressee(colon + 1, addressee, sizeof(addressee)))
        return false;

    return addresseeIsBroadcast(addressee);
}

// True if the address block of a TNC2 line carries a token or q-construct
// that forbids the packet reaching RF. Only the header is searched -
// everything up to the first ':' - so a message whose TEXT happens to mention
// one of these words is not mistaken for one routed with it. TCPXX, NOGATE
// and RFONLY are the classic path tokens APRS 1.1 says must not be
// forwarded; qAX marks a packet from an unverified APRS-IS login (FROMCALL
// equals the login, no valid passcode) and qAZ marks a packet its own igate
// has flagged as one that should not be propagated further - both are
// exactly as forbidden on RF as the path tokens. Checked against every line
// considered for INET->RF, not just messages, since none of these five apply
// to messages specifically.
//
// The related no-archive marker of APRS 1.1 - the literal "!x!" anywhere in a
// packet, which asks the databases behind APRS-IS not to store it - is
// deliberately not part of this test: it addresses the archives, not the
// gateways, and says nothing about where a frame may travel. This station
// never writes the marker into the traffic it originates, and a relayed
// packet keeps whatever it arrived with, since the payload crosses byte for
// byte.
static bool headerForbidsRf(const char *line) {
    const char *colon = strchr(line, ':');
    size_t headerLen = (colon != NULL) ? (size_t)(colon - line) : strlen(line);

    static const char *const tokens[] = { "TCPXX", "NOGATE", "RFONLY", "qAX", "qAZ" };
    for (size_t t = 0; t < sizeof(tokens) / sizeof(tokens[0]); t++) {
        const char *hit = strstr(line, tokens[t]);
        if (hit != NULL && (size_t)(hit - line) < headerLen)
            return true;
    }
    return false;
}

// Apply the three message-specific gating conditions to one message (the
// header-forbids-RF check has already run for the line in inet2rfHandler()).
// Returns true to transmit; every false return has already counted the
// reason it refused.
static bool messageGatePass(const char *srcLine, const char *srcCall, const char *info) {
    char addressee[12];
    if (!messageAddressee(info, addressee, sizeof(addressee))) {
        // Not shaped like a message after all: nothing to reason about, so
        // this is left to the type filter and the budlist that already ran.
        return true;
    }

    uint32_t window = g_config.igate_local_window_sec;
    uint8_t maxHops = g_config.igate_msg_max_hops;

    if (!lastheard_heard_rf_within(addressee, window)) {
        ESP_LOGD(TAG, "INET2RF message not gated - %s not heard on RF in the last %u s", addressee, (unsigned)window);
        igate_note_drop(DROP_MSG_NOT_LOCAL);
        return false;
    }
    // Heard, but the reach test is a separate question from the age test: the
    // coverage area an IGate gates into is measured in digipeater hops, so an
    // addressee whose frames arrive over a longer path than this station's own
    // transmissions travel is not somewhere a message can be delivered. The two
    // count under their own reasons so the dashboard names the condition that
    // stopped the message.
    if (!lastheard_heard_rf_within_hops(addressee, window, maxHops)) {
        ESP_LOGD(TAG, "INET2RF message not gated - %s heard on RF over more than %u digipeater hops", addressee, (unsigned)maxHops);
        igate_note_drop(DROP_MSG_ADDRESSEE_HOPS);
        return false;
    }
    // An addressee that is on APRS-IS itself can read the message there, so
    // putting a copy on the air is airtime for nothing. A reply from the
    // Winlink service is the one case where that premise is false: it exists
    // only because the addressee asked this station's gateway for it, it has
    // exactly one delivery path, and the echo of the addressee's own gated
    // command is itself enough to make the addressee look Internet-connected.
    // The exemption is deliberately narrow - it lifts this condition and no
    // other, and only for the configured service callsign.
    bool wl_exempt = g_config.wl_gate_exempt && winlink_is_service_call(srcCall);
    if (!wl_exempt && lastheard_heard_inet_within(addressee, window)) {
        ESP_LOGD(TAG, "INET2RF message not gated - %s is Internet-connected", addressee);
        igate_note_drop(DROP_MSG_ADDRESSEE_INET);
        return false;
    }
    if (lastheard_heard_rf_within(srcCall, window)) {
        ESP_LOGD(TAG, "INET2RF message not gated - sender %s was heard on RF: %s", srcCall, srcLine);
        igate_note_drop(DROP_MSG_SENDER_LOCAL);
        return false;
    }

    return true;
}

// ---------------------------------------------------------------------------
// Wrap a plain (non-third-party) APRS-IS line into the third-party frame this
// station transmits on RF for it, per the APRS third-party-traffic spec: our
// own header carries the frame, and the original station's data is preserved
// verbatim behind a '}' as the payload of that header, with its own path
// replaced by "TCPIP,<us>*" so a receiver can tell at a glance that the
// packet arrived over the Internet and was not heard locally. This is what
// keeps qAR/qAO/TCPIP and any other APRS-IS-only path token off the air, and
// is what lets every other IGate that hears the frame recognise it as already
// gated and avoid gating it back - the two together are the loop protection
// third-party wrapping exists to provide.
//
// The original path is discarded in full rather than filtered: only the
// inner source and destination calls (the header up to the first ',') are
// kept, everything from there to the first ':' is dropped, and this
// station's own configured IGate path takes its place. The information
// field after that first ':' is carried through unmodified.
//
// Returns the frame length on success, or 0 (after logging a warning) if
// the input line has no usable "SRC>DST...:" header, if either inner call is
// not a legal AX.25 address token, or if the built frame does not fit
// APRS_TNC2_BUF_SIZE - never a truncated frame.

// Both inner calls are copied straight out of an unauthenticated feed into a
// line this station then transmits, where every receiver reads them back as a
// callsign and as the head of a path. So they are held to the alphabet a call
// is written in - upper-case letters and digits, optionally followed by '-'
// and an SSID of 0 to 15 - and a line carrying anything else is dropped
// instead of gated: a token holding a space, a comma, a '>' or a ':' would
// re-punctuate the frame for whoever parses it next.
//
// The base is allowed up to THIRDPARTY_CALL_MAX_BASE characters rather than
// the six an AX.25 address field holds. These calls travel as text inside the
// information field, not as an address, and Internet-side sources longer than
// six characters are ordinary traffic on a full feed; shortening one would
// name a different station, and rejecting it would drop traffic that every
// other gateway carries.
#define THIRDPARTY_CALL_MAX_BASE 9

static bool thirdparty_call_is_legal(const char *call) {
    size_t i = 0;
    int ssid;

    while (call[i] != 0 && call[i] != '-') {
        if (!isupper((unsigned char)call[i]) && !isdigit((unsigned char)call[i]))
            return false;
        if (++i > THIRDPARTY_CALL_MAX_BASE)
            return false;
    }
    if (i == 0)
        return false;
    if (call[i] == 0)
        return true;

    // SSID: one or two digits, 0 to 15, and nothing after them.
    i++;
    if (!isdigit((unsigned char)call[i]))
        return false;
    ssid = call[i] - '0';
    i++;
    if (isdigit((unsigned char)call[i])) {
        ssid = ssid * 10 + (call[i] - '0');
        i++;
    }
    return call[i] == 0 && ssid <= 15;
}

static int build_thirdparty_frame(const char *inetLine, char *out, size_t outMax) {
    const char *gt = strchr(inetLine, '>');
    const char *colon = strchr(inetLine, ':');
    if (!gt || !colon || colon <= gt) {
        ESP_LOGW(TAG, "INET2RF: line has no usable header, not gated: %s", inetLine);
        return 0;
    }

    // A token that does not fit the buffer cannot be a legal call either, so
    // both fields are rejected on length here rather than shortened - a
    // truncated call would name a different station.
    char innerSrc[12];
    size_t srcLen = (size_t)(gt - inetLine);
    if (srcLen >= sizeof(innerSrc)) {
        ESP_LOGW(TAG, "INET2RF: line has an oversized source call, not gated: %s", inetLine);
        return 0;
    }
    memcpy(innerSrc, inetLine, srcLen);
    innerSrc[srcLen] = 0;

    const char *dstStart = gt + 1;
    const char *dstEnd = dstStart;
    while (dstEnd < colon && *dstEnd != ',')
        dstEnd++;
    char innerDst[12];
    size_t dstLen = (size_t)(dstEnd - dstStart);
    if (dstLen >= sizeof(innerDst)) {
        ESP_LOGW(TAG, "INET2RF: line has an oversized destination call, not gated: %s", inetLine);
        return 0;
    }
    memcpy(innerDst, dstStart, dstLen);
    innerDst[dstLen] = 0;

    if (!thirdparty_call_is_legal(innerSrc) || !thirdparty_call_is_legal(innerDst)) {
        ESP_LOGW(TAG, "INET2RF: line has an unusable source or destination call, not gated: %s", inetLine);
        return 0;
    }

    const char *info = colon + 1;

