hiperiondev/esp32idf_APRS/main/aprs_service.c
    // Snapshot the own-station identity and path selection used to build the
    // frame header, under the same lock a concurrent web save writes them
    // with, so nothing here observes aprs_mycall/aprs_ssid/igate_path
    // mid-update.
    char cfgMycall[10];
    uint8_t cfgSsid;
    uint8_t cfgPathSel;
    app_config_lock();
    memcpy(cfgMycall, g_config.aprs_mycall, sizeof(cfgMycall));
    cfgSsid = g_config.aprs_ssid;
    cfgPathSel = g_config.igate_path;
    app_config_unlock();
    // The copy above takes the full field width, so termination depends on
    // what the config loader stored. Force it: everything downstream treats
    // this as a C string, and a field filled edge to edge would send it
    // reading past the end of the local buffer.
    cfgMycall[sizeof(cfgMycall) - 1] = 0;

    char callField[16];
    if (cfgSsid > 0)
        snprintf(callField, sizeof(callField), "%s-%d", cfgMycall, (int)cfgSsid);
    else
        snprintf(callField, sizeof(callField), "%s", cfgMycall);

    char gatePath[80];
    aprs_path_build_suffix_from_config(cfgPathSel, gatePath, sizeof(gatePath));

    int n = snprintf(out, outMax, "%s>" IGATE_THIRDPARTY_DEST "%s:}%s>%s,TCPIP,%s*:%s", callField, gatePath, innerSrc, innerDst, callField, info);
    if (n < 0)
        return 0;
    if ((size_t)n >= outMax || n > APRS_TNC2_MAX_LEN) {
        ESP_LOGW(TAG, "INET2RF third-party frame too long (%d bytes, max %d), not gated: %s", n, APRS_TNC2_MAX_LEN, inetLine);
        return 0;
    }
    return n;
}

// ---------------------------------------------------------------------------
// INET -> RF: called by igate.c for every non-comment line read from APRS-IS.
// ---------------------------------------------------------------------------
static void inet2rfHandler(const char *line) {
    // Feed the dashboard LAST HEARD table from APRS-IS too, not just RF, so
    // there's something to see while verifying the IGate uplink even before
    // the local radio has decoded anything. TNC2 line looks like
    // "SRC-N>DST,PATH,qAR,SERVER:info" - split at '>' for the callsign and
    // at ':' for the via/path, matching what aprs_msg_callback does for RF.
    char callsign[12] = "";
    char symTable = 0, symCode = 0;

    // Is this BrandMeister traffic? Classified once, here, from the raw line,
    // and reused by everything below: the last-heard row, the range gate's log
    // line and the message-routing rule all have to agree on the answer, and
    // the header is only in hand at this point.
    //
    // The gateway list is snapshotted under the config lock for the same
    // reason every other string field is: this runs on the IGate task while a
    // web save may be rewriting it.
    aprs_bm_match_t bmMatch = APRS_BM_MATCH_NONE;
    if (g_config.bm_en) {
        char gateways[APRS_BM_GATEWAYS_MAX][APRS_BM_GATEWAY_LEN];
        app_config_lock();
        memcpy(gateways, g_config.bm_gateways, sizeof(gateways));
        app_config_unlock();
        for (int i = 0; i < APRS_BM_GATEWAYS_MAX; i++)
            gateways[i][APRS_BM_GATEWAY_LEN - 1] = 0;
        bmMatch = aprs_bm_classify(line, gateways, APRS_BM_GATEWAYS_MAX);
    }
    const bool viaBm = (bmMatch != APRS_BM_MATCH_NONE);

    {
        const char *gt = strchr(line, '>');
        const char *colon = strchr(line, ':');
        if (gt && colon && colon > gt) {
            size_t callLen = (size_t)(gt - line);
            if (callLen >= sizeof(callsign))
                callLen = sizeof(callsign) - 1;
            memcpy(callsign, line, callLen);
            callsign[callLen] = 0;

            char path[48];
            size_t pathLen = (size_t)(colon - gt - 1);
            if (pathLen >= sizeof(path))
                pathLen = sizeof(path) - 1;
            memcpy(path, gt + 1, pathLen);
            path[pathLen] = 0;

            const char *info = colon + 1;
            size_t infoLen = strlen(info);
            // Same symbol precedence as the RF path above: information
            // field first, Mic-E included, then the destination address of
            // the TNC2 header, then the source SSID for raw NMEA only.
            if (!aprs_extract_symbol(info, infoLen, &symTable, &symCode) && infoLen > 0)
                aprs_symbol_from_tnc2_header(line, info[0], &symTable, &symCode);

            // A frame that arrived over APRS-IS was never heard off the air
            // here, so it is never direct and has no RF hop count.
            lastheard_add(callsign, path, false, false, 0, symTable, symCode, viaBm);
        }
    }

    // See the identical note at the RF call site above: handleIncomingAPRS()
    // must run for directed queries and for Telegram routing even when
    // messaging itself is off. Both entry points are told the line came from
    // the APRS-IS feed, which is what lets the query responder keep internet
    // traffic off the transmitter: a general query such as "?APRS?" is
    // ordinary backbone traffic, and the answer to one belongs on the channel
    // the question arrived on.
    if (g_config.msg_enable || (g_config.query_en && g_config.query_directed_en) || telegram_app_routing_active())
        handleIncomingAPRS(line, QUERY_SRC_INET);

    if (g_config.query_en)
        query_process(line, QUERY_SRC_INET);

    if (g_config.inet2rf) {
        // Generic queries ("?APRS?", "?WX?", "?IGATE?", ...) are never gated
        // onto RF: transmitting one over the air would let a single APRS-IS
        // client trigger a query responder reply from every RF station that
        // implements one within earshot. This check is unconditional and
        // independent of g_config.inet2rfFilter, so it cannot be defeated by
        // any checkbox state. A directed query (":CALLSIGN :?APRSD", data
        // type ':') is unaffected: only a payload whose first byte is '?' is
        // dropped here.
        {
            const char *colon = strchr(line, ':');
            if (colon && colon[1] == '?') {
                igate_note_drop(DROP_GENERIC_QUERY);
                return;
            }
        }

