hiperiondev/esp32idf_APRS/main/aprs_service.c
        // Never gate our OWN reports from INET back to RF. After we upload a
        // beacon / weather / telemetry / message report to APRS-IS (via its
        // *_2inet flag) the server echoes it right back to us; without this
        // guard the IGATE INET->RF filter below would decide whether our own
        // report is re-transmitted on RF, so turning a type OFF in that filter
        // would silence our own report on the air. Our reports must reach RF
        // ONLY through their own "Send via RF" (*_2rf) flags (weather.c /
        // beacon.c); this filter governs foreign internet traffic exclusively.
        // Re-gating our own echo would also double-transmit it (once directly
        // via *_2rf, once here) and is a classic IGate feedback-loop source.
        if (inet_line_is_own_report(line)) {
            ESP_LOGD(TAG, "INET2RF: own report echoed by APRS-IS, not re-gated (its *_2rf flag governs RF): %s", line);
            return;
        }

        // TCPXX / NOGATE / RFONLY / qAX / qAZ in the header all mean the same
        // thing: this packet must not reach RF. Checked here, ahead of the
        // type filter and budlist, so it applies to every line INET->RF
        // considers - positions and objects included, not just messages -
        // and independently of g_config.igate_msg_gate_en.
        if (headerForbidsRf(line)) {
            ESP_LOGD(TAG, "INET2RF: not gated, header forbids RF: %s", line);
            igate_note_drop(DROP_HEADER_FORBIDS_RF);
            return;
        }

        // Bulletins, announcements and weather service broadcasts are never
        // put on the air from the APRS-IS feed. A bulletin is addressed to
        // everybody, is repeated for as long as it stands, is never
        // acknowledged and runs to 67 characters of text, and the feed
        // carries every one of them worldwide; relaying that stream turns a
        // single station into a bulletin repeater for the whole network on
        // the shared local channel. The same reasoning as the generic query
        // drop applies, and so does the same placement: this check is
        // unconditional and independent of both g_config.igate_msg_gate_en
        // and g_config.inet2rfFilter, so no checkbox state can defeat it,
        // and it runs ahead of the type filter that would otherwise be the
        // only thing standing between the feed and the transmitter. A
        // message addressed to a station is unaffected: only the broadcast
        // addressee families are matched here, and they are the traffic an
        // operator on the local channel has no way to answer or refuse.
        if (lineIsBroadcastMessage(line)) {
            ESP_LOGD(TAG, "INET2RF: not gated, bulletin/broadcast addressee: %s", line);
            igate_note_drop(DROP_MSG_BROADCAST);
            return;
        }

        // g_config.inet2rfFilter is a whitelist of payload types (the IGATE
        // Filter fieldset on the /igate page): classify the line and drop it
        // unless its bit is set. Unclassifiable payloads - third-party
        // traffic in particular, which is exactly how an IGate loop starts -
        // classify as 0 and never pass.
        //
        // Dropped lines are logged at debug level only: the RX-IS entry
        // igate.c already added to the traffic ring covers them, and an
        // unfiltered APRS-IS feed would otherwise flush the ring with lines
        // that never went anywhere.
        uint16_t type = aprs_filter_classify_tnc2(line);

        // The plain (non-third-party) TNC2 line that build_thirdparty_frame()
        // below wraps for RF, and the callsign the budlist check is keyed on.
        // Normally both are just the line/callsign as received; the selective
        // third-party unwrap below (only ever reachable for an explicitly
        // whitelisted inner source) may swap both to the unwrapped inner
        // packet instead.
        const char *srcLine = line;
        char budlistCall[12];
        strncpy(budlistCall, callsign, sizeof(budlistCall) - 1);
        budlistCall[sizeof(budlistCall) - 1] = 0;

        // Associated position: a station this gateway has just put a message
        // on the air for gets exactly one of its position reports gated too,
        // whatever the type filter says, so the local operator can plot the
        // far end of the conversation. The claim is taken here rather than
        // after the budlist, so a station the operator has since blacklisted
        // spends its follow-up instead of holding a slot forever. Only plain
        // position and buoy reports qualify - a weather or object report is
        // gated under its own type bit, on its own merits.
        bool assocPosition = false;
        if ((type & (IGATE_FILT_POSITION | IGATE_FILT_BUOY)) != 0 && msgAssocTake(budlistCall)) {
            assocPosition = true;
            ESP_LOGD(TAG, "INET2RF: gating the position follow-up owed to %s", budlistCall);
        }

        // Local distance gate, the mirror image of the RF->INET one in
        // igate.c. Placed ahead of the type filter and the budlist, so it
        // composes with them under AND semantics exactly as its RF->INET twin
        // does, and behind the associated-position claim just above, so a
        // position this gateway already owes a station it messaged is still
        // gated however far away that station turns out to be.
        //
        // This gate, together with the position requirement further down, is
        // what makes a wide server-side subscription safe to put on the air.
        // APRS-IS filter terms are OR'd, never AND'd - a packet matching any
        // one term is passed - so a subscription such as "u/APBM*
        // r/lat/lon/150" asks for BrandMeister traffic worldwide OR anything
        // within 150 km, and the intersection the operator actually wants
        // cannot be expressed to the server at all. It has to be enforced
        // here, before the transmitter.
        //
        // A line carrying no position of its own has no distance to test and
        // is governed by the position requirement further down, once the
        // payload actually bound for the air is known.
        if (!assocPosition && g_config.inet2rf_range_en) {
            bool rangeEn;
            float rangeKm, ownLat, ownLon;
            app_config_lock();
            rangeEn = g_config.inet2rf_range_en;
            rangeKm = g_config.inet2rf_range_km;
            ownLat = g_config.my_lat;
            ownLon = g_config.my_lon;
            app_config_unlock();

            if (rangeEn && rangeKm > 0.0f) {
                char destCall[12] = "";
                const char *colon = strchr(line, ':');
                float plat, plon;
                aprs_tnc2_dest_call(line, destCall, sizeof(destCall));
                if (colon && aprs_filter_decode_position(colon + 1, destCall, &plat, &plon)) {
                    float d = aprs_filter_haversine_km(ownLat, ownLon, plat, plon);
                    if (d > rangeKm) {
                        ESP_LOGD(TAG, "INET2RF range-filtered (%.1f km > %.1f km)%s: %s", d, rangeKm, viaBm ? " [BM]" : "", callsign);
                        igate_note_drop(DROP_INET2RF_RANGE);
                        return;
                    }
                }
            }
        }

        if (!assocPosition && !aprs_filter_pass(g_config.inet2rfFilter, type)) {
            // Selective third-party ('}') unwrap: off by default
            // (inet2rf_3rdparty_unwrap_en), and even when enabled only ever
            // fires for a payload that (a) is third-party-wrapped and (b)
            // whose INNER source callsign is itself explicitly whitelisted
            // on the local budlist (inet2rf_budlist_mode == BUDLIST_WHITELIST
            // AND that callsign in g_config.budlist[]). This combination -
            // opt-in AND per-source trust, never either alone - is what
            // keeps this from turning into "relay all third-party traffic",
            // which is the #1 way IGate feedback loops get re-introduced;
            // see aprs_filter_classify_thirdparty_inner()'s docs.
            bool unwrapped = false;

            if (g_config.inet2rf_3rdparty_unwrap_en && g_config.inet2rf_budlist_mode == BUDLIST_WHITELIST) {
                const char *colon = strchr(line, ':');
                if (colon && colon[1] == '}') {
                    // The third-party payload ("}SRC>DST,PATH:payload") is
                    // itself a complete TNC2-style line - unwrapping it is
                    // just skipping the leading '}'.
                    const char *inner = colon + 2;
                    const char *igt = strchr(inner, '>');
                    char innerSrc[12] = "";
                    if (igt) {
                        size_t n = (size_t)(igt - inner);
                        if (n >= sizeof(innerSrc))
                            n = sizeof(innerSrc) - 1;
                        memcpy(innerSrc, inner, n);
                        innerSrc[n] = 0;
                    }

                    // Reject a payload that is itself third-party-wrapped
                    // more than one level deep outright, rather than
                    // unwrapping it again or letting it fall through to the
                    // generic type filter: aprs_filter_classify_thirdparty_inner()
                    // already classifies a nested '}' payload as
                    // unclassifiable (type 0, never passes), but a dedicated
                    // check here makes the one-level limit explicit and
                    // auditable and gives it its own drop counter instead of
                    // being folded into DROP_TYPE_FILTER. A frame nested this
                    // way has been wrapped more than once already; unwrapping
                    // it here would let it re-enter as a fresh single-wrap
                    // frame and grow without bound on every further hop.
                    const char *innerColon = strchr(inner, ':');
                    if (innerColon && innerColon[1] == '}') {
                        ESP_LOGD(TAG, "INET2RF: third-party payload nested more than one level, not unwrapped: %s", line);
                        igate_note_drop(DROP_3RDPARTY_NESTED);
                    } else if (lineIsBroadcastMessage(inner)) {
                        // The broadcast-addressee rule above is stated for
                        // every line this handler considers, so the packet
                        // that comes out of an unwrap is held to it too:
                        // whitelisting a station's third-party traffic is
                        // permission to relay that station, not permission
                        // to put the bulletin stream on the air behind it.
                        ESP_LOGD(TAG, "INET2RF: third-party payload is a bulletin/broadcast, not unwrapped: %s", inner);
                        igate_note_drop(DROP_MSG_BROADCAST);
                    } else {
                        uint16_t innerType = aprs_filter_classify_thirdparty_inner(colon + 1);

                        if (innerSrc[0] && aprs_filter_budlist_pass(BUDLIST_WHITELIST, innerSrc) && aprs_filter_pass(g_config.inet2rfFilter, innerType)) {
                            srcLine = inner;
                            type = innerType;
                            strncpy(budlistCall, innerSrc, sizeof(budlistCall) - 1);
                            budlistCall[sizeof(budlistCall) - 1] = 0;
                            unwrapped = true;
                            ESP_LOGI(TAG, "INET2RF: relaying whitelisted third-party packet from %s (unwrapped): %s", innerSrc, inner);
                        }
                    }
                }
            }

            if (!unwrapped) {
                ESP_LOGD(TAG, "INET2RF filtered (%s, mask=0x%03X): %s", aprs_filter_type_name(type), (unsigned)g_config.inet2rfFilter, line);
                igate_note_drop(DROP_TYPE_FILTER);
                return;
            }
        }

