hiperiondev/esp32idf_APRS/main/aprs_service.c
        // Local callsign whitelist/blacklist (INET->RF direction): composes
        // (AND semantics) with the type filter just above, same as the
        // RF->INET side in igate.c's igateProcess(). Keyed on budlistCall,
        // which is the unwrapped inner source when the third-party unwrap
        // above fired, or the as-received callsign otherwise. (Redundant
        // with the whitelist check already done above in the unwrap case,
        // but kept here too so this line always goes through the exact same
        // gate as every other INET->RF packet.)
        if (!aprs_filter_budlist_pass(g_config.inet2rf_budlist_mode, budlistCall)) {
            ESP_LOGD(TAG, "INET2RF budlist-filtered (mode=%d): %s", (int)g_config.inet2rf_budlist_mode, budlistCall);
            igate_note_drop(DROP_BUDLIST);
            return;
        }

        // Position requirement. A payload that carries no position of its own
        // - a status report, a telemetry frame, an unclassifiable payload -
        // offers nothing that places it inside the local area, and the range
        // gate above had no distance to measure for it. Such a line is
        // refused rather than passed unmeasured, because the assumption that
        // would justify passing it - that the operator's own server-side
        // "r/lat/lon/radius" term already delivered nothing but local traffic
        // - only holds for a subscription made of geographic terms alone. Any
        // traffic-class term alongside one (the BrandMeister worldwide
        // monitor "u/APBM*" of aprs_bm.h is the case this firmware names,
        // though a "t/" or "u/" term of any kind behaves the same) widens the
        // feed to the whole network, and a repeater status broadcast from the
        // far side of it would otherwise reach the transmitter with no
        // geographic gate ever having looked at it. The feed offers that
        // traffic far faster than a 1200 Bd channel clears it, so what
        // arrives is not one stray packet but a flood that fills the RF TX
        // ring.
        //
        // Read from srcLine, which is the packet actually bound for the air:
        // where the selective third-party unwrap above fired, it is the inner
        // packet's own position that has to place it locally, not the
        // wrapper's absence of one. Independent of the range gate, since it
        // is the absence of a position rather than the size of a radius that
        // it acts on, and skipped for the two payload families gated on
        // something other than where they came from: a message, which is
        // gated on its addressee, and a position follow-up this gateway
        // already owes a station it messaged. A BrandMeister-classified line
        // is held to the requirement whatever the setting says, this
        // station's own gates being the only geographic restriction such a
        // line is ever subject to (see docs/en/functionality/brandmeister.rst).
        if (!assocPosition && (type & IGATE_FILT_MESSAGE) == 0 && (g_config.inet2rf_position_required || viaBm)) {
            char destCall[12] = "";
            const char *colon = strchr(srcLine, ':');
            float plat, plon;
            aprs_tnc2_dest_call(srcLine, destCall, sizeof(destCall));
            if (!colon || !aprs_filter_decode_position(colon + 1, destCall, &plat, &plon)) {
                ESP_LOGD(TAG, "INET2RF: no position to place it locally%s: %s", viaBm ? " [BM]" : "", line);
                igate_note_drop(DROP_INET2RF_NO_POSITION);
                return;
            }
        }

        // Locally-heard source gate: the counterpart, for the source of
        // ordinary traffic, of the test the message gate below makes on an
        // addressee. A station nobody in earshot has ever heard is a station
        // the local channel has no use for hearing about, and relaying it
        // spends airtime the stations that ARE local have to share. Keyed on
        // budlistCall - the unwrapped inner source where the selective
        // third-party unwrap fired, the as-received source otherwise - and on
        // the same igate_local_window_sec the message gate uses, so "heard
        // locally" means one thing throughout the gateway.
        //
        // Message traffic is exempt: its own gate tests the addressee, which
        // is the end of the conversation that has to be in earshot. The
        // position follow-up owed to a station this gateway messaged is
        // exempt for the same reason.
        if (g_config.inet2rf_heard_only && !assocPosition && (type & IGATE_FILT_MESSAGE) == 0) {
            uint16_t window;
            app_config_lock();
            window = g_config.igate_local_window_sec;
            app_config_unlock();

            if (!lastheard_heard_rf_within(budlistCall, window)) {
                ESP_LOGD(TAG, "INET2RF: %s not heard on RF in the last %u s, not gated", budlistCall, (unsigned)window);
                igate_note_drop(DROP_INET2RF_NOT_HEARD);
                return;
            }
        }

        // Per-source spacing. Every gate above answers "may this line reach
        // RF at all"; this one answers "how much of the channel may one
        // source take", which no payload-type mask or callsign list can
        // express. A 1200 Bd channel carries roughly one frame per second and
        // the feed can offer tens in that time, so without a floor on the
        // interval a single busy source fills the RF TX ring on its own and
        // every other station's traffic is discarded behind it.
        //
        // Claimed here rather than after the transmit below so that a frame
        // the transmitter refuses does not spend the source's slot, and
        // exempting the same two families as the gate above: message traffic
        // is what the gateway exists to carry, and an owed position follow-up
        // is a single frame by construction.
        if (!assocPosition && (type & IGATE_FILT_MESSAGE) == 0 && !inet2rfRateAllow(budlistCall)) {
            ESP_LOGD(TAG, "INET2RF: %s gated too recently, spacing limit applied", budlistCall);
            igate_note_drop(DROP_INET2RF_RATE);
            return;
        }

        // Message gating policy. Only the MESSAGE type is subject to it: the
        // remaining types are gated at the sysop's discretion, which is what
        // the type filter and the budlist above already express.
        if (g_config.igate_msg_gate_en && type == IGATE_FILT_MESSAGE) {
            const char *infoSep = strchr(srcLine, ':');
            if (infoSep == NULL || !messageGatePass(srcLine, budlistCall, infoSep + 1))
                return;
        }

        // Gated traffic is never keyed onto RF with its APRS-IS header
        // intact: build_thirdparty_frame() replaces that header with this
        // station's own call and path and wraps the original SRC>DST plus
        // its information field, unmodified, behind a '}' as the payload -
        // the mandatory third-party form that keeps qA constructs and TCPIP
        // off the air and lets other IGates recognise the frame as already
        // gated. It already logs a warning on failure (an unusable header or
        // a frame that would not fit), on the same terms as every other
        // packet builder in this firmware, so nothing more is done here than
        // declining to transmit.
        char thirdPartyFrame[APRS_TNC2_BUF_SIZE];
        int txLen = build_thirdparty_frame(srcLine, thirdPartyFrame, sizeof(thirdPartyFrame));
        if (txLen <= 0)
            return;

        // Only an actual APRS message (including the ack sent back for one)
        // is exempt from the duty-cycle ceiling here - the rest of the
        // INET->RF relay (position/object/weather/telemetry/bulletins picked
        // up from APRS-IS) is exactly the bulk, non-critical traffic that
        // ceiling exists to hold back. `type` reflects the unwrapped inner
        // payload when the selective third-party unwrap above fired, so this
        // always tests the type actually being transmitted.
        if (send_tnc2_impl(thirdPartyFrame, (size_t)txLen, (type & IGATE_FILT_MESSAGE) != 0)) {
            atomic_fetch_add_explicit(&s_statInet2Rf, 1, memory_order_relaxed);
            ESP_LOGD(TAG, "INET2RF TX: %.*s", txLen, thirdPartyFrame);
            trafficlog_add_pkt("INET2RF", budlistCall, thirdPartyFrame, "", -1, symTable, symCode);

            // MSG_CNT in the "?IGATE?" answer counts APRS messages this
            // gateway has passed, in both directions. srcLine's ':' ends
            // its TNC2 address block, so its information field starts right
            // after it and a message is the payload whose first byte is the
            // ':' data type identifier.
            const char *infoSep = strchr(srcLine, ':');
            if (infoSep != NULL && infoSep[1] == ':') {
                igate_note_message_gated();

                // Note the addressee so the next position report seen for it
                // on the APRS-IS feed is gated as well.
                char addressee[12];
                if (messageAddressee(infoSep + 1, addressee, sizeof(addressee)))
                    msgAssocRemember(addressee);
            }
        }
    }
}

// ---------------------------------------------------------------------------
// Outbound message TX: message.c hands us a built TNC2 packet + channel mask.
// ---------------------------------------------------------------------------
static void messageTxHandler(const char *packet, size_t len, uint8_t channels) {
    // Critical: APRS messages (and their acks/retries) are exempt from the
    // duty-cycle ceiling in send_tnc2_impl() - see the block comment there.
    if (channels & MSG_CHANNEL_RF)
        send_tnc2_impl(packet, len, true);
    if (channels & MSG_CHANNEL_INET)
        igate_send_raw(packet, len);
}

// The application does not pump the DSP or drain the frame queue: the modem
// component owns both. AFSK_init() starts its own pinned RX DSP task, and
// modem_init() starts the "modem_svc" task that drives
// AFSK_ServiceTx()/Ax25TransmitCheck() and delivers RX frames to the callback.
// Calling AFSK_Poll() from here would race that task over the same FIFO.
// The modem component has no RF power-switch output, so there is no
// rf_power/band config to carry.

static void serviceTickTask(void *arg) {
    while (1) {
        // Periodic heap sample, first in the pass so that consecutive lines
        // are taken at the same point of the cycle and describe the heap
        // between passes rather than in the middle of one. This is the only
        // place that records the allocator while everything is working; every
        // other heap figure in the log is printed after something failed.
        heap_monitor_tick_1hz();

        // 1 Hz weather sensor refresh, folded in here rather than given a task
        // of its own, which saves that task's stack. weather_start() has
        // already run by the time this task is created, so the shared container
        // and sensor registry are ready.
        weather_service_1hz();

        // 1 Hz Binary (digital B1-B8) telemetry channel refresh - reads the
        // same sensors_local registry weather_service_1hz() does, so it is
        // folded into this existing task rather than getting its own.
        telemetry_service_1hz();

        // SNTP bootstrap step, also folded in here instead of a dedicated
        // time_sync task (saves its 4 KB stack). Non-blocking: it just advances
        // the state machine armed by time_sync_start() and returns.
        time_sync_1hz();

        // 1 Hz Telegram bot step, folded in here for the same reason as the
        // two above: it only reads counters and decides whether a bring-up or
        // a teardown is due, and it spawns a worker task for the rare moments
        // when either is. Keeping that work off a permanent task of its own is
        // what stops the bot from holding a large stack while it is merely
        // running.
        telegram_app_tick_1hz();

        // 1 Hz Winlink session step, folded in here for the same reason as the
        // ones above: it only advances a state machine whose every forward
        // transition is driven by a reply the messaging engine has already
        // delivered, and it neither blocks nor touches the filesystem.
        winlink_tick_1hz();

        if (g_config.msg_enable)
            sendAPRSMessageRetry();

        ESP_LOGD(TAG, "aprs_svc_tick stack free: %u bytes", (unsigned)(uxTaskGetStackHighWaterMark(NULL) * sizeof(StackType_t)));

