hiperiondev/esp32idf_APRS/main/aprs_service.c
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

// ---------------------------------------------------------------------------
// Audio ADC/DAC AFSK modem "LOOP TEST" (Radiomodem webconfig page).
// ---------------------------------------------------------------------------

#define LOOP_TEST_TIMEOUT_MS 4000

// Minimum raw ADC swing (out of the 0-4095 12-bit range) that counts as "an
// audio tone actually reached the ADC" rather than a flat/near-DC line. Used
// both to diagnose a FAIL (see the adcSwing < LOOP_TEST_MIN_ADC_SWING branch
// below) and, symmetrically, to gate a PASS: a decoded frame is only ever
// reachable through Ax25ReadNextRxFrame() -> ax25_decode(), both of which
// require a CRC-clean HDLC bitstream, so a token match with no corroborating
// analog swing does not mean the CRC check is faulty - it means the frame
// being matched did not originate from this test's own transmission on this
// physical loop, and reporting PASS on it would certify a link that was never
// actually exercised end to end.
#define LOOP_TEST_MIN_ADC_SWING 50

// How long aprs_loop_test_run() will wait for a clear channel (no DCD lock on
// real off-air traffic) before keying up regardless. Bounded so a stuck/
// falsely-latched DCD (or continuously heavy traffic) can't hang the test
// forever - it just proceeds and, if that on-air signal really does corrupt
// the self-test frame, reports the normal failure diagnostics.
#define LOOP_TEST_CHANNEL_WAIT_MS 3000

static SemaphoreHandle_t s_loopTestSem = NULL;
static volatile bool s_loopTestActive = false;
// Guards the claim of s_loopTestActive. Reading the flag and setting it are one
// indivisible step - two overlapping requests must not both come away believing
// they own the test, which a plain read-then-write would allow. A portMUX (not a
// mutex) because the claim is a handful of instructions and can then be made
// with no allocation and no init-order dependency.
static portMUX_TYPE s_loopTestLock = portMUX_INITIALIZER_UNLOCKED;
static volatile bool s_loopTestGotFrame = false;
static char s_loopTestToken[8];
static char s_loopTestRxInfo[128];
static uint16_t s_loopTestRxMVrms = 0;

void aprs_service_notify_modem_ready(void) {
    s_modemReady = true;
}

bool aprs_service_modem_ready(void) {
    return s_modemReady;
}

bool aprs_service_can_transmit(void) {
    return s_modemReady && g_config.audio_modem_en;
}

bool aprs_service_can_gate_to_rf(void) {
    return aprs_service_can_transmit() && g_config.igate_en && g_config.inet2rf;
}

// ---------------------------------------------------------------------------
// Loop-test diagnostics.
//
// The modem exposes instantaneous getters - afskGetRms(), afskGetAgcGain(),
// afskGetDcOffset(), ModemDcdState(), Ax25GetRxStage(), ModemGetSignalLevel() -
// plus a passive raw-sample tap, afskDiagCaptureRaw(), that snapshots the
// samples the modem's own ingest path sees without disturbing the live RX task.
// None of them latch.
//
// The latching the test needs is therefore done here: a monitor task samples
// those getters throughout the test window and records the peaks and
// high-water marks the failure messages are built from. That is enough to tell
// the four failure classes apart (ADC dead vs. no tone vs. tone but no lock vs.
// lock but no frame), with two limits noted where they are reported:
//   - the receive gate is not reported separately: a signal strong enough to
//     swing the ADC opens it, and the blocks it held are demodulated when it
//     does, so "no lock" already covers a gate that never opened;
//   - there are no CRC-failure counters, so the furthest HDLC RX stage reached
//     is what distinguishes "frames were attempted" from "nothing started".
// ---------------------------------------------------------------------------
#define LOOP_DIAG_RAW_SAMPLES 512

typedef struct {
    volatile bool stop;
    // Raw ADC min/max, captured mid-preamble via the passive sample tap.
    int16_t rawMin;
    int16_t rawMax;
    int rawCount;
    // High-water marks sampled across the whole test window.
    uint16_t mVrmsPeak;
    float agcGainPeak;
    // OR of the ModemDcdState() bitmaps sampled across the test window, so a
    // bit stays set once that demodulator has locked at least once.
    uint8_t dcdLatch;
    uint8_t rxStageMax[MODEM_MAX_DEMODULATOR_COUNT];
    uint32_t adcSamplesStart;
    uint32_t adcSamplesEnd;
    volatile TaskHandle_t task;
} loop_diag_t;

static loop_diag_t s_diag;

static void loopDiagTask(void *arg) {
    loop_diag_t *d = (loop_diag_t *)arg;
    static int16_t raw[LOOP_DIAG_RAW_SAMPLES];

    // Wait out the start of the preamble so the capture lands on real tone
    // rather than on the idle line, then take one passive snapshot.
    vTaskDelay(pdMS_TO_TICKS(50));
    d->rawCount = afskDiagCaptureRaw(raw, LOOP_DIAG_RAW_SAMPLES, 500);
    for (int i = 0; i < d->rawCount; i++) {
        if (raw[i] < d->rawMin)
            d->rawMin = raw[i];
        if (raw[i] > d->rawMax)
            d->rawMax = raw[i];
    }

    while (!d->stop) {
        uint16_t rms = afskGetRms();
        if (rms > d->mVrmsPeak)
            d->mVrmsPeak = rms;

        float gain = afskGetAgcGain();
        if (gain > d->agcGainPeak)
            d->agcGainPeak = gain;

        d->dcdLatch |= ModemDcdState();

        uint8_t demods = ModemGetDemodulatorCount();
        if (demods > MODEM_MAX_DEMODULATOR_COUNT)
            demods = MODEM_MAX_DEMODULATOR_COUNT;
        for (uint8_t i = 0; i < demods; i++) {
            uint8_t stage = (uint8_t)Ax25GetRxStage(i);
            if (stage > d->rxStageMax[i])
                d->rxStageMax[i] = stage;
        }

        d->adcSamplesEnd = afskGetAdcSampleCount();
        vTaskDelay(pdMS_TO_TICKS(2));
    }

    d->task = NULL;
    vTaskDelete(NULL);
}

static void loopDiagStart(void) {
    memset(&s_diag, 0, sizeof(s_diag));
    s_diag.rawMin = INT16_MAX;
    s_diag.rawMax = INT16_MIN;
    s_diag.adcSamplesStart = afskGetAdcSampleCount();
    s_diag.adcSamplesEnd = s_diag.adcSamplesStart;
    s_diag.stop = false;
    if (xTaskCreate(loopDiagTask, "loop_diag", 3072, &s_diag, 7, (TaskHandle_t *)&s_diag.task) != pdPASS) {
        s_diag.task = NULL;
        ESP_LOGW(TAG, "Loop test: could not start the diagnostics task - a failure will be reported without detail");
    }
}

