hiperiondev/esp32idf_APRS/main/aprs_service.c
static void loopDiagStop(void) {
    s_diag.stop = true;
    // The task deletes itself; give it a few of its 2 ms polls to notice.
    for (int i = 0; i < 20 && s_diag.task != NULL; i++)
        vTaskDelay(pdMS_TO_TICKS(5));
}

// AX.25 RX hook installed only while a loop test is in flight, so a
// self-generated test frame is never mistaken for real RF traffic
// (digipeated, sent to APRS-IS, etc.).
static void loopTestRxHook(ax25_msg_t *msg) {
    size_t n = msg->len < sizeof(s_loopTestRxInfo) - 1 ? msg->len : sizeof(s_loopTestRxInfo) - 1;
    memcpy(s_loopTestRxInfo, msg->info, n);
    s_loopTestRxInfo[n] = 0;
    s_loopTestRxMVrms = msg->mVrms;
    s_loopTestGotFrame = true;
    xSemaphoreGive(s_loopTestSem);
}

bool aprs_loop_test_run(char *msg, size_t msg_len) {
    if (!aprs_service_can_transmit()) {
        snprintf(msg, msg_len,
                 "Audio ADC/DAC modem is not enabled/initialized. Enable \"Enable audio ADC/DAC modem\" above, save, and reboot the device first.");
        ESP_LOGW(TAG, "Loop test: %s", msg);
        return false;
    }

    // Claim the test atomically: whoever wins sets the flag inside the same
    // critical section that read it, so a second request always sees it set.
    bool busy;
    portENTER_CRITICAL(&s_loopTestLock);
    busy = s_loopTestActive;
    if (!busy)
        s_loopTestActive = true;
    portEXIT_CRITICAL(&s_loopTestLock);
    if (busy) {
        snprintf(msg, msg_len, "A loop test is already running - please wait for it to finish.");
        ESP_LOGW(TAG, "Loop test: %s", msg);
        return false;
    }

    if (!s_loopTestSem)
        s_loopTestSem = xSemaphoreCreateBinary();
    if (!s_loopTestSem) {
        // Nothing below can work without it: the RX hook signals completion
        // through this semaphore and the wait below is what times the test.
        // Release the claim so a later attempt, on a less exhausted heap, can
        // still run.
        s_loopTestActive = false;
        snprintf(msg, msg_len, "Could not start the loop test: out of memory allocating its completion semaphore. Reboot the device and try again.");
        ESP_LOGE(TAG, "Loop test: %s", msg);
        return false;
    }
    xSemaphoreTake(s_loopTestSem, 0); // drain any stale/leftover give (a fresh binary semaphore is already empty)

    // Unique token per run, so we only accept *this* frame as a pass, not
    // some coincidental leftover/duplicate packet.
    uint32_t token = esp_random() & 0xFFFFFF;
    snprintf(s_loopTestToken, sizeof(s_loopTestToken), "%06lX", (unsigned long)token);

    char tnc2[48];
    int n = snprintf(tnc2, sizeof(tnc2), "SELFTST>APLT1T:>LOOPTEST %s", s_loopTestToken);

    s_loopTestGotFrame = false;
    s_rxHook = loopTestRxHook;

    // A DAC->ADC wire means the node always hears its own carrier, so in the
    // half-duplex config normal operation uses, Ax25TransmitCheck()'s CSMA
    // would never find a clear channel and the test frame would never be
    // keyed. Switch to full duplex for the duration and put the configured
    // mode back afterwards, whatever the outcome.
    modem_config_t testCfg;
    aprs_service_build_modem_config(&testCfg, true);
    modem_set_modem(&testCfg);

    // ModemDcdState() reflects the demodulator's lock state on whatever is
    // actually arriving at the ADC, independent of the full/half-duplex flag
    // just set above (that flag only gates Ax25TransmitCheck()'s own CSMA
    // logic, not the DCD reading itself) - so it still sees a real off-air
    // station here. If one is on the air right now, wait for it to clear
    // (bounded, so a stuck DCD or continuously busy channel can't hang the
    // test) before keying up, instead of transmitting the self-test tone
    // straight over it and risking a spurious failure.
    TickType_t waitStart = xTaskGetTickCount();
    while (ModemDcdState()) {
        if ((xTaskGetTickCount() - waitStart) >= pdMS_TO_TICKS(LOOP_TEST_CHANNEL_WAIT_MS)) {
            ESP_LOGW(TAG, "Loop test: channel still busy after %d ms, transmitting anyway", LOOP_TEST_CHANNEL_WAIT_MS);
            break;
        }
        vTaskDelay(pdMS_TO_TICKS(20));
    }

    loopDiagStart();

    ESP_LOGI(TAG, "Loop test: TX %s", tnc2);
    if (!aprs_service_send_tnc2(tnc2, (size_t)n))
        ESP_LOGW(TAG, "Loop test: TX frame was discarded, test will time out");

    bool signaled = (xSemaphoreTake(s_loopTestSem, pdMS_TO_TICKS(LOOP_TEST_TIMEOUT_MS)) == pdTRUE);

    loopDiagStop();

    // Always restore the real RX hook and the configured duplex mode before
    // doing anything else, so a failed/timed-out test doesn't leave real RX
    // frames being swallowed by the test hook or the radio keying over other
    // stations.
    s_rxHook = aprs_msg_callback;
    aprs_service_apply_modem_config();
    s_loopTestActive = false;

    if (!signaled || !s_loopTestGotFrame) {
        int adcSwing = (s_diag.rawCount > 0) ? ((int)s_diag.rawMax - (int)s_diag.rawMin) : 0;
        bool adcAlive = (s_diag.adcSamplesEnd != s_diag.adcSamplesStart);

        if (!adcAlive || s_diag.rawCount == 0) {
            // The sample counter never moved / the ISR tap produced nothing -
            // the ADC continuous driver isn't running at all. That's an init
            // failure, not a wiring or level problem.
            snprintf(msg, msg_len,
                     "FAIL: no packet was received back within %d ms, and the ADC never delivered a single sample "
                     "(%d captured, sample counter stuck at %lu). The ADC continuous driver/timer isn't running - "
                     "this points at an init failure, not a wiring or level problem.",
                     LOOP_TEST_TIMEOUT_MS, s_diag.rawCount, (unsigned long)s_diag.adcSamplesStart);
        } else if (adcSwing < LOOP_TEST_MIN_ADC_SWING) {
            // The ADC is sampling, but the raw code barely moved - it is not
            // seeing the DAC's tone at all (flat/near-DC line). Report the DC
            // offset the component tracks (already in mV) alongside the raw
            // codes: a line pinned near VDD points at a miswire or a short
            // rather than at the demodulator's units and scaling.
            snprintf(msg, msg_len,
                     "FAIL: no packet was received back within %d ms. The ADC is sampling (raw code stayed within "
                     "%d-%d, a %d-count swing; DC offset ~%d mV), but is not seeing any audio tone - check that "
                     "GPIO%d (ADC in) and GPIO%d (DAC out) are actually wired together and both grounds are common.",
                     LOOP_TEST_TIMEOUT_MS, s_diag.rawMin, s_diag.rawMax, adcSwing, afskGetDcOffset(), MODEM_ADC_GPIO, MODEM_DAC_GPIO);
        } else if (s_diag.dcdLatch == 0) {
            // A real signal swing reached the ADC but no demodulator's PLL
            // ever asserted DCD, i.e. none of them locked onto the tones.
            // The receive gate cannot be the cause on its own: a signal that
            // swings the ADC this far opens it, and DCD is the lock
            // indicator for everything past it.
            //
            // The input level is common to every demodulator, so it is
            // reported once; what differs between them is the prefilter tilt.
            int8_t peak0 = 0, valley0 = 0;
            uint8_t level0 = 0;
            ModemGetSignalLevel(0, &peak0, &valley0, &level0);

            char tilts[48] = "";
            size_t tl = 0;
            uint8_t demods = ModemGetDemodulatorCount();
            if (demods > MODEM_MAX_DEMODULATOR_COUNT)
                demods = MODEM_MAX_DEMODULATOR_COUNT;
            for (uint8_t i = 0; i < demods && tl < sizeof(tilts); i++) {
                int n = snprintf(tilts + tl, sizeof(tilts) - tl, "%s%+.1f", i ? "/" : "", (double)ModemGetFilterTiltDb(i));
                if (n < 0)
                    break;
                tl += (size_t)n;
            }

            snprintf(msg, msg_len,
                     "FAIL: no packet was received back within %d ms. The ADC saw a real signal (raw code swung "
                     "%d-%d, a %d-count range; RMS peaked at %u mV), so the demodulator did receive samples, but no "
                     "demodulator's correlator/PLL ever locked onto the tones. %u demodulator(s), prefilter tilt %s dB, "
                     "flat audio input %s, input level=%u%% (AGC peak gain %.2fx). %s",
                     LOOP_TEST_TIMEOUT_MS, s_diag.rawMin, s_diag.rawMax, adcSwing, (unsigned)s_diag.mVrmsPeak, (unsigned)demods, tilts,
                     g_config.audio_lpf ? "on" : "off", (unsigned)level0, (double)s_diag.agcGainPeak,
                     (s_diag.agcGainPeak <= 1.05f) ? "The AGC gain never rose above unity, so the correlator saw the same tiny raw signal as "
                                                     "the ADC - check the AGC path rather than the baud rate."
                                                   : "Check that the AFSK modulation/baud rate on this page matches what was transmitted, and "
                                                     "try the three-filter demodulator preset (a direct DAC->ADC loop never passes through a "
                                                     "real radio's de-emphasis network, so its tones arrive with no twist).");
        } else {
            // A demodulator locked, but no valid AX.25 frame with the expected
            // token came back within the timeout. "Locked" only means enough
            // correctly-timed symbol transitions were seen - a much lower bar
            // than "every bit in a ~20-byte frame was clean". Report how far
            // the HDLC state machine got: reaching RX_STAGE_FRAME means flags
            // were found and bytes were being assembled, so the framing works
            // and the bits themselves are dirty; never getting past
            // RX_STAGE_FLAG/IDLE means bit-sync never produced a frame at all.
            uint8_t stageMax = 0;
            for (int i = 0; i < MODEM_MAX_DEMODULATOR_COUNT; i++)
                if (s_diag.rxStageMax[i] > stageMax)
                    stageMax = s_diag.rxStageMax[i];

            snprintf(msg, msg_len,
                     "FAIL: no packet was received back within %d ms, even though the demodulator's PLL locked onto "
                     "the tones (DCD bitmap 0x%02X - bit N is demodulator N - RMS peaked at %u mV, AGC peak "
                     "gain %.2fx). Furthest HDLC receive "
                     "stage reached: %u (0=idle, 1=flag seen, 2=assembling a frame). %s",
                     LOOP_TEST_TIMEOUT_MS, (unsigned)s_diag.dcdLatch, (unsigned)s_diag.mVrmsPeak, (double)s_diag.agcGainPeak, (unsigned)stageMax,
                     (stageMax < (uint8_t)RX_STAGE_FRAME) ? "No HDLC flag ever led into frame data - the bit-sync/framing state machine isn't "
                                                            "starting a frame at all, which points at bit recovery rather than at noise on "
                                                            "individual bits."
                                                          : "The receiver did start assembling frames but none passed the CRC check - the signal is "
                                                            "clean enough to fake a brief DCD lock but not clean enough to get an entire ~20-byte "
                                                            "frame bit-perfect. Check for a marginal signal level/SNR rather than a "
                                                            "baud-rate/modem-type mismatch.");
        }
        ESP_LOGW(TAG, "Loop test: %s", msg);
        return false;
    }

