hiperiondev/esp32idf_APRS/main/aprs_service.c
    char expected[24];
    snprintf(expected, sizeof(expected), ">LOOPTEST %s", s_loopTestToken);

    if (strstr(s_loopTestRxInfo, expected) != NULL) {
        // Report the same raw-swing/AGC figures used in the FAIL diagnostics
        // above, not just RMS, so a PASS still gives enough to tell a
        // comfortably-clean signal from one that only just scraped by (e.g.
        // when tuning RV1/RV2 audio level trimmers on the interface board:
        // the swing figure is the clipping-margin indicator - the 12-bit ADC
        // rails are 0/4095, so a healthy centered swing should sit well
        // short of either end).
        int adcSwing = (s_diag.rawCount > 0) ? ((int)s_diag.rawMax - (int)s_diag.rawMin) : 0;

        // A token match alone is not proof this test's own tone made the
        // round trip: it is proof SOME CRC-clean frame carrying that token
        // was decoded. Require the swing this same run captured to clear the
        // same floor the FAIL branches above use for "an audio tone actually
        // reached the ADC", so a PASS can never be reported over a physically
        // open loop (dead air, floating/unterminated ADC input, or a stale
        // decode racing in from something other than this run's own DAC
        // output).
        if (adcSwing < LOOP_TEST_MIN_ADC_SWING || s_loopTestRxMVrms == 0) {
            snprintf(msg, msg_len,
                     "FAIL: a frame carrying the expected token was decoded, but the raw ADC swing captured during "
                     "this run (%d-%d, a %d-count swing) and RX level (%u mV RMS) do not show a real audio tone "
                     "reaching the ADC. This is not a genuine pass - check that GPIO%d (ADC in) and GPIO%d (DAC out) "
                     "are actually wired together (or routed through the radio, for a radiomodem loop test) and both "
                     "grounds are common.",
                     s_diag.rawMin, s_diag.rawMax, adcSwing, (unsigned)s_loopTestRxMVrms, MODEM_ADC_GPIO, MODEM_DAC_GPIO);
            ESP_LOGW(TAG, "Loop test: %s", msg);
            return false;
        }

        snprintf(msg, msg_len,
                 "PASS: sent \"%s\" and correctly decoded it back (RX level %u mV RMS, raw ADC swing %d-%d [%d counts, "
                 "rails are 0/4095], AGC peak gain %.2fx). The AFSK modem works correctly.",
                 tnc2 + (strchr(tnc2, ':') - tnc2) + 1, (unsigned)s_loopTestRxMVrms, s_diag.rawMin, s_diag.rawMax, adcSwing, (double)s_diag.agcGainPeak);
        ESP_LOGI(TAG, "Loop test: %s", msg);
        return true;
    }

    snprintf(msg, msg_len,
             "FAIL: a packet was received back, but its content did not match what was sent (got \"%s\"). Check for audio "
             "distortion, clipping, or an incorrect ADC/DAC loopback wiring.",
             s_loopTestRxInfo);
    ESP_LOGW(TAG, "Loop test: %s", msg);
    return false;
}

// ---------------------------------------------------------------------------
// Audio interface diagnostics.
//
// Both of these exist because the loop test cannot be used once a transceiver
// is connected in place of the DAC-to-ADC jumper: it transmits a frame and
// waits to hear it back, which only a wire loop can deliver. They split that
// job in two - measure the receive side without transmitting, and transmit a
// bounded burst without expecting anything back - so each half of the audio
// interface can be adjusted against the equipment it is wired to.
//
// They share the loop test's claim flag rather than adding a second one: all
// three drive the same modem and the same diagnostics state, so only one may
// run at a time.
// ---------------------------------------------------------------------------

// Length of the window aprs_rx_level_sample() watches the receiver over. Long
// enough to span several packets' worth of channel activity at 1200 Bd, short
// enough that a web request does not appear to hang.
#define RX_LEVEL_WINDOW_MS 1000

// Interval between samples inside that window, matching the loop test's own
// diagnostics task.
#define RX_LEVEL_POLL_MS 20

// How long the transmit burst keys up for. Long enough to read a deviation
// meter, short enough to stay well inside what a hand-held transmitter is
// comfortable with on a duty cycle this test does not repeat.
#define TX_TEST_BURST_MS 3000

// @brief Claim the diagnostics, so only one of the three can be in flight.
// @return true when the claim succeeded.
static bool diagClaim(void) {
    bool busy;

    portENTER_CRITICAL(&s_loopTestLock);
    busy = s_loopTestActive;
    if (!busy)
        s_loopTestActive = true;
    portEXIT_CRITICAL(&s_loopTestLock);

    return !busy;
}

bool aprs_rx_level_sample(char *json, size_t json_len) {
    if (!aprs_service_modem_ready()) {
        snprintf(json, json_len, "{\"ok\":false,\"msg\":\"The audio ADC/DAC modem is not running.\"}");
        return false;
    }

    if (!diagClaim()) {
        snprintf(json, json_len, "{\"ok\":false,\"msg\":\"Another audio test is already running.\"}");
        return false;
    }

    // None of the modem's getters latch, so the peaks and the high-water marks
    // are accumulated here, over the window, exactly as loopDiagTask() does for
    // the loop test.
    uint16_t rmsPeak = 0;
    uint32_t rmsSum = 0;
    uint32_t rmsCount = 0;
    float agcPeak = 0.0f;
    bool dcd = false;
    int16_t rawMin = 0;
    int16_t rawMax = 0;

    TickType_t start = xTaskGetTickCount();
    while ((xTaskGetTickCount() - start) < pdMS_TO_TICKS(RX_LEVEL_WINDOW_MS)) {
        uint16_t rms = afskGetRms();

        if (rms > rmsPeak)
            rmsPeak = rms;
        rmsSum += rms;
        rmsCount++;

        float gain = afskGetAgcGain();
        if (gain > agcPeak)
            agcPeak = gain;

        if (ModemDcdState())
            dcd = true;

        vTaskDelay(pdMS_TO_TICKS(RX_LEVEL_POLL_MS));
    }

    afskGetRawMinMax(&rawMin, &rawMax);

    unsigned mean = (rmsCount > 0) ? (unsigned)(rmsSum / rmsCount) : 0;

    // The AGC gain is rendered from hundredths held in an integer rather than
    // through a float conversion: the gain is bounded by the AGC's own limits,
    // and an integer pair keeps the length of the rendered object bounded too,
    // which a float field would not be.
    if (agcPeak < 0.0f)
        agcPeak = 0.0f;
    else if (agcPeak > 999.0f)
        agcPeak = 999.0f;
    unsigned agcCenti = (unsigned)((agcPeak * 100.0f) + 0.5f);

    // Receive statistics since the demodulator set was last changed: what
    // each demodulator decoded, what only it decoded, and whether any
    // samples were lost before reaching them.
    modem_rx_stats_t st;
    modem_get_rx_stats(&st);

    // Every field is produced locally, so there is nothing here that could
    // carry a byte off the air into the response.
    snprintf(json, json_len,
             "{\"ok\":true,\"mVrms\":%u,\"peak_mVrms\":%u,\"dc_mV\":%d,\"agc\":%u.%02u,"
             "\"raw_min\":%d,\"raw_max\":%d,\"dcd\":%s,\"adc_samples\":%lu,"
             "\"demods\":%u,\"decoded\":[%lu,%lu,%lu],\"unique\":[%lu,%lu,%lu],\"delivered\":%lu,\"repaired\":%lu,"
             "\"fifo_drops\":%lu,\"pool_ovf\":%lu}",
             mean, (unsigned)rmsPeak, afskGetDcOffset(), agcCenti / 100u, agcCenti % 100u, (int)rawMin, (int)rawMax, dcd ? "true" : "false",
             (unsigned long)afskGetAdcSampleCount(), (unsigned)st.demod_count, (unsigned long)st.decoded[0], (unsigned long)st.decoded[1],
             (unsigned long)st.decoded[2], (unsigned long)st.unique[0], (unsigned long)st.unique[1], (unsigned long)st.unique[2], (unsigned long)st.delivered,
             (unsigned long)st.repaired, (unsigned long)st.fifo_drops, (unsigned long)st.adc_pool_overflows);

    ESP_LOGI(TAG, "RX level: %u mV RMS (peak %u), DC offset %d mV, AGC %u.%02ux, raw %d..%d, DCD %s", mean, (unsigned)rmsPeak, afskGetDcOffset(),
             agcCenti / 100u, agcCenti % 100u, (int)rawMin, (int)rawMax, dcd ? "yes" : "no");
    ESP_LOGI(TAG, "RX stats: %u demod(s), decoded %lu/%lu/%lu, unique %lu/%lu/%lu, delivered %lu, repaired %lu, FIFO drops %lu, pool overflows %lu",
             (unsigned)st.demod_count, (unsigned long)st.decoded[0], (unsigned long)st.decoded[1], (unsigned long)st.decoded[2], (unsigned long)st.unique[0],
             (unsigned long)st.unique[1], (unsigned long)st.unique[2], (unsigned long)st.delivered, (unsigned long)st.repaired, (unsigned long)st.fifo_drops,
             (unsigned long)st.adc_pool_overflows);

    s_loopTestActive = false;
    return true;
}

bool aprs_tx_test_run(char *msg, size_t msg_len) {
    if (!aprs_service_can_transmit()) {
        snprintf(msg, msg_len, "The audio ADC/DAC modem is not enabled. Enable \"Enable audio ADC/DAC modem\" above, save, and reboot the device first.");
        ESP_LOGW(TAG, "TX test: %s", msg);
        return false;
    }

    if (!diagClaim()) {
        snprintf(msg, msg_len, "Another audio test is already running - please wait for it to finish.");
        ESP_LOGW(TAG, "TX test: %s", msg);
        return false;
    }

    // Sent through the ordinary non-critical transmit path, so the normal
    // half-duplex channel access applies and the long-term duty-cycle ceiling
    // holds the burst back when it is enabled and already reached.
    char tnc2[48];
    int n = snprintf(tnc2, sizeof(tnc2), "SELFTST>APLT1T:>TXTEST");

    if (!aprs_service_send_tnc2(tnc2, (size_t)n)) {
        snprintf(msg, msg_len,
                 "The transmit burst was not sent: the channel access path discarded it. A duty-cycle ceiling that has already been reached, or a full "
                 "transmit queue, are the usual reasons - the event log says which.");
        ESP_LOGW(TAG, "TX test: %s", msg);
        s_loopTestActive = false;
        return false;
    }

    // The frame is queued, not yet on the air: the modem service task keys up,
    // clocks it out and unkeys on its own schedule. Waiting here for the burst
    // to finish is what makes the result meaningful to read on the page, and
    // the wait is bounded so a transmitter that never keys cannot hold the
    // request open.
    TickType_t start = xTaskGetTickCount();
    while ((xTaskGetTickCount() - start) < pdMS_TO_TICKS(TX_TEST_BURST_MS)) {
        if ((modem_tx_queue_depth() == 0) && !getTransmit() && ((xTaskGetTickCount() - start) > pdMS_TO_TICKS(200)))
            break;
        vTaskDelay(pdMS_TO_TICKS(20));
    }

    snprintf(msg, msg_len,
             "Transmitted a test frame with %ums of preamble at %u%% output swing. Measure the deviation on other equipment and set the transmit level "
             "trimmer for 2.5 to 3.5 kHz.",
             (unsigned)g_config.preamble, (unsigned)g_config.dac_amplitude_pct);
    ESP_LOGI(TAG, "TX test: %s", msg);

    s_loopTestActive = false;
    return true;
}

void aprs_service_start(void) {
    // Created before anything below it: igate_start() a few lines down and
    // the Telegram bring-up path main.c's app_task() enables later in the
    // boot sequence both take this lock around their own heavy setup work,
    // so it must exist and be available before either can run.
    heap_monitor_init();

