hiperiondev/esp32idf_APRS/main/aprs_service.c
    trafficlog_init();
    lastheard_init();
    message_init();
    message_alarm_configure(g_config.msg_alarm_enable, g_config.msg_alarm_gpio);
    message_set_tx_handler(messageTxHandler);
    igate_set_inet2rf_handler(inet2rfHandler);
    igate_set_inet2rf_assoc_query(msgAssocPending);

    query_init();
    query_set_tx_handler(messageTxHandler); // reuse the same RF/INET TX plumbing

    // Winlink client. Registered after message_init() because it installs the
    // message observer the session state machine is driven by, and after the
    // storage partition is mounted because it loads its mailbox from there.
    winlink_init();

    // Install the RX callback before main.c calls modem_init(): the component
    // starts its service task inside modem_init() and can deliver a frame the
    // moment it does.
    modem_set_rx_callback(on_rx_frame, NULL);

    // Always start the uplink task: it idles itself (socket closed,
    // fast retry loop) whenever nothing needs APRS-IS, and comes up as soon
    // as igate_en, digi_loc2inet, or msg_inet is turned on - including via
    // a runtime web UI save, with no reboot required.
    igate_start();

    beacon_start();

    // Own-station weather: creates the shared weather_telemetry_data container,
    // refreshes it from the local sensor drivers at 1 Hz, and beacons an APRS
    // Weather Report at wx_interval.
    weather_start();

    // Own-station telemetry (Binary/digital B1-B8 channel 0): resolves the
    // operator's per-bit channel mapping from the same sensors_local registry
    // weather_start() just brought up, and beacons a "T#..." Telemetry Data
    // Report at its configured data interval (plus BITS metadata at its
    // configured info interval) - both stored in their own
    // /storage/telemetry.json, not g_config; see telemetry.h.
    telemetry_start();

    // Periodic APRS bulletins (BLN1..BLN5), configured on the "Bulletins" web
    // admin page and persisted in their own LittleFS file (not g_config). The
    // task also enforces per-bulletin expiry.
#ifdef ENABLE_BULLETINS
    bulletins_start();
#endif

    // Periodic APRS Objects/Items, configured on the "Objects and Items" web
    // admin page and persisted in their own LittleFS file (not g_config). The
    // shared scheduler drives their transmission and kill retransmissions.
#ifdef ENABLE_OBJECTS_ITEMS
    objitems_start();
#endif

    // Single shared task that drives all of the above periodic transmissions
    // (tracker/igate/digi beacons, WX report, bulletins). Started last, after
    // beacon_start()/weather_start()/bulletins_start() have set up the state
    // its service functions read. Driving every periodic transmitter from one
    // ~14 KB task instead of one task per transmitter is what keeps the total
    // stack footprint of the beacon layer small enough for this heap.
    beacon_scheduler_start();

    // The modem runs its own RX DSP and TX service tasks (see the note above
    // serviceTickTask); the only task this layer needs for itself is the 1 Hz
    // housekeeping tick below. See APRS_SVC_TICK_TASK_STACK_BYTES above for
    // why it needs the budget it does.
    xTaskCreate(serviceTickTask, "aprs_svc_tick", APRS_SVC_TICK_TASK_STACK_BYTES, NULL, 4, NULL);

    ESP_LOGI(TAG, "APRS service started (digi=%d igate=%d msg=%d)", g_config.digi_en, g_config.igate_en, g_config.msg_enable);
}
